function 各种药材增加(){
   var _loc1_ = random(所有药材.length);
   所有药材[_loc1_].数量 += 1;
}
function 太后赐温情酒(){
   var _loc2_ = [];
   i = 0;
   while(i < _all_feizi.length){
      if(_all_feizi[i].爱 < 500 && _all_feizi[i].孕 == 0&& _all_feizi[i].位分 !== "秀女" && _all_feizi[i].仙 == 0 && _all_feizi[i].年龄 < 30 && _all_feizi[i].任性 < 100 && _all_feizi[i].清廉 > 80 && _all_feizi[i].生育 == 0 && _all_feizi[i].性别 == 1 && _all_feizi[i].状态 == 0 && _all_feizi[i]._code !== 7004){
         _loc2_.push(_all_feizi[i]);
      }
      i++;
   }
   if(_loc2_.length == 0){
      console.log("没有合适的妃子赐酒");
   }
   else{
	  var 目标 = _loc2_[random(_loc2_.length)];
	  console.log(目标);
      播放音乐("Music_34",1);
	  id('剧情对话').style.display = 'block';
	  id('剧情背景').src =LJ +  'a0aPic_BG/Tu_5.webp';
	  新后宫图形读取程序(剧情头像,40,"特殊");
      对话打字效果("皇上：孩儿给母后请安。母后近日身体可好？");
      剧情对话板.onclick = function(){
		 新后宫图形读取程序(剧情头像,40,"特殊");
         对话打字效果("太后：哀家的身体，还是老样子，倒是皇帝最近好像过于劳累了。");
         剧情对话板.onclick = function(){
			新后宫图形读取程序(剧情头像,0,"皇帝");
            对话打字效果("皇上：让母后担心了，这几日政务繁忙，没有时间好好休息。");
            剧情对话板.onclick = function(){
				新后宫图形读取程序(剧情头像,40,"特殊");
               对话打字效果("太后：哀家觉得是得有个善解人意的人儿好好侍候皇帝才行，皇帝也要记得皇嗣为重。");
               剧情对话板.onclick = function(){
				  新后宫图形读取程序(剧情头像,0,"皇帝");
                  对话打字效果("皇上：是，孩儿日后必当谨记。");
                  剧情对话板.onclick = function(){
					新后宫图形读取程序(剧情头像,40,"特殊");
                     对话打字效果("太后：别日后了，哀家觉得" + _all_palace[目标.宫殿].名称 + "的" + 目标.封号 + 目标.位分 + "就不错，温柔贤惠，哀家很喜欢。刚刚派人送去了一壶温情酒给" + 目标.封号 + 目标.位分 + "，皇帝有空就去她宫里坐坐吧。");
                     剧情对话板.onclick = function(){
						新后宫图形读取程序(剧情头像,0,"皇帝");
                        对话打字效果("皇上：母后的一番苦心，孩儿明白。");
                        剧情对话板.onclick = function(){
						新后宫图形读取程序(剧情头像,40,"特殊");
                           对话打字效果("太后：那就好，快去吧，哀家要休息了。");
                           剧情对话板.onclick = function(){
                              停止音乐();
                              id('剧情对话').style.display = 'none';
                              缓动黑幕();
                              目标.状态 = 1;
                              var _loc2_ = 0;
                              while(_loc2_ < 剧情汇总.length){
                                 if(剧情汇总[_loc2_]._code == 111){
                                    剧情汇总[_loc2_].达成 = 1;
                                 }
                                 _loc2_ = _loc2_ + 1;
                              }
                           };
                        };
                     };
                  };
               };
            };
         };
      };
   }
}
function 妃子半路截人(对象){
   var _loc3_ = [];
   var _loc2_ = 0;
   while(_loc2_ < _all_feizi.length){
      if(_all_feizi[_loc2_].名字 !== 对象.名字 && _all_feizi[_loc2_].孕 == 0 && _all_feizi[_loc2_].病 == 0 && (_all_feizi[_loc2_].省亲 == 0 || _all_feizi[_loc2_].省亲 == undefined) && _all_feizi[_loc2_].任性 > 30 && _all_feizi[_loc2_].性别 == 1){
         _loc3_.push(_all_feizi[_loc2_]);
      }
      _loc2_ = _loc2_ + 1;
   }
   if(_loc3_.length == 0){
      出现这位后宫(对象);
   }
   else{
      var 谁截人 = _loc3_[random(_loc3_.length)];
      var _loc4_ = [];
      _loc4_.push(谁截人.封号 + 谁截人.位分 + ":皇上~！皇上~！您在哪儿？臣妾好害怕……\n（御驾行到半路，听到" + 谁截人.封号 + 谁截人.位分 + "梦魇了，皇上是否要过去陪" + 谁截人.封号 + 谁截人.位分 + "？还是去找" + 对象.封号 + 对象.位分 + "？）。");
      _loc4_.push(谁截人.封号 + 谁截人.位分 + ":皇上，臣妾听闻皇上最近有些劳累，特意做了一碗莲叶羹，给皇上送来。\n（御驾行到半路，" + 谁截人.封号 + 谁截人.位分 + "来送点心了，皇上是否要过去陪" + 谁截人.封号 + 谁截人.位分 + "？还是去找" + 对象.封号 + 对象.位分 + "？）。");
      _loc4_.push(谁截人.封号 + 谁截人.位分 + ":翩若惊鸿，婉若游龙，荣曜秋菊，华茂春松。仿佛兮若轻云之蔽月，飘飖兮若流风之回雪……\n（御驾行到半路，听到" + 谁截人.封号 + 谁截人.位分 + "的歌声婉转动听，皇上是否要过去陪" + 谁截人.封号 + 谁截人.位分 + "？还是去找" + 对象.封号 + 对象.位分 + "？）。");
      _loc4_.push("（远远传来琴声，是" + 谁截人.封号 + 谁截人.位分 + "弹的一首《湘妃怨》……皇上是否要过去陪" + 谁截人.封号 + 谁截人.位分 + "？还是去找" + 对象.封号 + 对象.位分 + "？）。");
      _loc4_.push("（远远飘来一阵香气，是" + 谁截人.封号 + 谁截人.位分 + "宫中焚烧的欢宜香……皇上是否要过去陪" + 谁截人.封号 + 谁截人.位分 + "？还是去找" + 对象.封号 + 对象.位分 + "？）。");
      _loc2_ = 0;
	  剧情对话板.onclick = function(){}
      while(_loc2_ < 剧情汇总.length){
         if(剧情汇总[_loc2_]._code == 89){
            剧情汇总[_loc2_].达成 = 1;
         }
         _loc2_ = _loc2_ + 1;
      }
	  var mc = id('皇宫背景').src;
	  id('剧情对话').style.display = 'block';
	  id('剧情背景').src =LJ +  'a0aPic_BG/Tu_8837469.webp';
	  出现这个人的头像(剧情头像,谁截人);
      对话打字效果(_loc4_[random(_loc4_.length)],[对象.封号 + 对象.位分 + "",谁截人.封号 + 谁截人.位分 + ""]);
      
	  id('剧情an0').onclick = function(){
         id('剧情对话').style.display = 'none';
         缓动黑幕();
         对象.爱 += 10;
         谁截人.爱 -= 10;
         出现这位后宫(对象);
      };
      id('剧情an1').onclick = function(){
         id('剧情对话').style.display = 'none';
         缓动黑幕();
         谁截人.爱 += 10;
         谁截人.任性 += 2 * 谁截人.野心 / 100;
         对象.爱 -= 30;
         出现这位后宫(谁截人);
      };
   }
}
function 发现漂亮宫女(妃子, 宫女){
   var _loc3_ = 0;
   while(_loc3_ < 剧情汇总.length){
      if(剧情汇总[_loc3_]._code == 90){
         剧情汇总[_loc3_].达成 = 1;
      }
      _loc3_ = _loc3_ + 1;
   }
   var mc = id('皇宫背景').src;
   id('剧情对话').style.display = 'block';
   出现这个人的头像(剧情头像,宫女);
   var _loc6_ = 计算背景程序(妃子);
   id('剧情背景').src =LJ +  _loc6_;
   对话打字效果("皇上：诶？这是" + _all_palace[妃子.宫殿].名称 + "新来的宫女吗？长相倒是挺不错的。叫什么名字啊？");
   剧情对话板.onclick = function(){
      对话打字效果(宫女.名称 + "：奴婢贱名" + 宫女.名称 + "，是前些天刚刚进宫来" + _all_palace[妃子.宫殿].名称 + "侍奉的。");
      剧情对话板.onclick = function(){
         出现这个人的头像(剧情头像,妃子);
         if(妃子.野心 > 50){
            对话打字效果(妃子.封号 + 妃子.位分 + "：这是……内务府新派来的粗笨宫女。（冲着" + 宫女.名称 + "）不懂事的丫头，在这里光站着干嘛？还不赶快去准备厨房看看给皇上做的御膳好了没。");
         }
         else{
            对话打字效果(妃子.封号 + 妃子.位分 + "：这丫头不仅长相清秀，人也十分伶俐，皇上若真喜欢她，又不嫌弃她的出身，不如封个位分收入后宫？");
         }
         剧情对话板.onclick = function(){
            出现这个人的头像(剧情头像,宫女);
            if(妃子.野心 > 50){
               对话打字效果(宫女.名称 + "：是……奴婢这就去。");
            }
            else{
               对话打字效果(宫女.名称 + "：这……奴婢惶恐。");
            }
            剧情对话板.onclick = function(){
               对话打字效果("（要改让" + 宫女.名称 + "侍寝吗？）",["让她侍寝","算了"]);
               id('剧情an0').onclick = function(){
				   新后宫图形读取程序(剧情头像,0,'皇帝');
                  if(妃子.野心 > 50){
                     对话打字效果("皇上：等一下，朕今天还是回养心殿休息吧，就由" + 宫女.名称 + "来侍寝。");
                  }
                  else{
                     对话打字效果("皇上：难得" + 妃子.封号 + 妃子.位分 + "费心了，那就去养心殿，由" + 宫女.名称 + "侍寝吧。");
                  }
                  剧情对话板.onclick = function(){
                     id('剧情对话').style.display = 'none';
                     缓动黑幕();
                     妃子.爱 -= 10;
                     var _loc1_ = 0;
                     while(_loc1_ < 丫环名人.length){
                        if(丫环名人[_loc1_]._code == 宫女._code){
                           var _loc2_ = 丫环名人[_loc1_];
                        }
                        _loc1_ = _loc1_ + 1;
                     }
                     _loc2_.名字 = _loc2_.名称;
                     _loc2_.头像 = _loc2_.跳;_loc2_.生育=0;
                     _loc2_.年龄 = 14;_loc2_.经验=0;_loc2_.爱=random(20)+30;
					 _loc2_.出身=  _all_palace[妃子.宫殿].名称+"宫女";
                     console.log("宫女信息：名字" + _loc2_.名字 + ",年龄" + _loc2_.年龄 + "统" + _loc2_.统帅 + "、武" + _loc2_.武力 + "、智" + _loc2_.智力 + "、政" + _loc2_.政治 + "、魅" + _loc2_.魅力);
                     出现这位后宫(_loc2_,1);
                     辞退这个宫人(宫女);
                  };
               };
               id('剧情an1').onclick = function(){
                  if(妃子.野心 > 50){
                     对话打字效果("皇上：算了，别理她了，朕可是来找你的。");
                  }
                  else{
                     对话打字效果("皇上：算了，还是留个伶俐的宫女伺候你更重要，朕还是更属意于你。");
                  }
                  剧情对话板.onclick = function(){
					 出现这个人的头像(剧情头像,妃子);
                     对话打字效果(妃子.封号 + 妃子.位分 + "：皇上……");
                     剧情对话板.onclick = function(){
                        id('剧情对话').style.display = 'none';
                        缓动黑幕();
                        妃子.爱 += 10;
                        宫女.能力 = 3;
                        出现这位后宫(妃子);
                     };
                  };
               };
            };
         };
      };
   };
}
function 言官告发重大案件(){
   主角.大臣参见 = 1;
   var _loc3_ = [];
   var _loc2_ = [];
   i = 0;
   while(i < _all_rencai.length){
      if(_all_rencai[i].清廉 < 60 && _all_rencai[i].状态 !== 4){
         _loc3_.push(_all_rencai[i]);
      }
      if(_all_rencai[i].智力 > 80 && _all_rencai[i].清廉 > 80 && _all_rencai[i].野心 < 40 && _all_rencai[i].关系 > 10 && (_all_rencai[i].状态 == 0 || _all_rencai[i].状态 == 1)){
         _loc2_.push(_all_rencai[i]);
      }
      i++;
   }
   if(!(_loc3_.length == 0 || _loc2_.length == 0)){
	   var 贪官 = _loc3_[random(_loc3_.length)];
	   var 言官 = _loc2_[random(_loc2_.length)];
	  id('剧情对话').style.display = 'block';
	  id('剧情背景').src =LJ +  'a0aPic_BG/Tu_13.webp';
	  出现这个人的头像(剧情头像,言官);
      对话打字效果(言官.名字 + "：皇上，有件事情，事关重大，请允许臣向皇上秘密禀报，以免打草惊蛇。");
      剧情对话板.onclick = function(){
		新后宫图形读取程序(剧情头像,0,'皇帝');
         对话打字效果("皇上：什么事？爱卿请讲。");
         剧情对话板.onclick = function(){
            罪名一 = ["贪污敛财、","收受贿赂、","强征税负、","非法圈地、","官商勾结、","结党营私、"];
            罪名二 = ["私占良田、","纵容亲属、","判案不公、","草菅人命、","私吞物资、"];
            罪名五 = ["饮酒闹事","任人唯亲","不理政务","搜刮百姓","杀人放火","强拆民居"];
			出现这个人的头像(剧情头像,言官);
            对话打字效果(言官.名字 + "：皇上，" + 贪官.名字 + 罪名一[random(罪名一.length)] + 罪名二[random(罪名二.length)] + 罪名五[random(罪名五.length)] + "，臣认为已经不能再放任他了，否则将不可收拾。这是言官们的弹劾折子。");
            剧情对话板.onclick = function(){
               对话打字效果("（折子上写了" + 贪官.名字 + "的种种罪行，" + 言官.名字 + "言之凿凿弹劾" + 贪官.名字 + "）");
               剧情对话板.onclick = function(){
				   新后宫图形读取程序(剧情头像,0,'皇帝');
                  对话打字效果("皇上：此事先不要声张，待朕思之，过后再做处置。");
                  剧情对话板.onclick = function(){
					  出现这个人的头像(剧情头像,言官);
                     对话打字效果(言官.名字 + "：臣遵旨。");
                     剧情对话板.onclick = function(){
                     id('剧情对话').style.display = 'none';
                        缓动黑幕();
                     };
                  };
               };
            };
         };
      };
   }
}
function 一仗红事件(){
   var _loc2_ = [];
   var _loc3_ = [];
   var _loc4_ = 0;
   while(_loc4_ < _all_feizi.length){
      if(_all_feizi[_loc4_].名字 !== undefined){
         if(_all_feizi[_loc4_].位分 != "秀女"  && _all_feizi[_loc4_].地位 <= 3  && (_all_feizi[_loc4_].省亲 == 0 || _all_feizi[_loc4_].省亲 == undefined)){
            _loc2_.push(_all_feizi[_loc4_]);
         }
         else if(_all_feizi[_loc4_].位分 != "秀女"  && _all_feizi[_loc4_].地位 >= 6  && (_all_feizi[_loc4_].省亲 == 0 || _all_feizi[_loc4_].省亲 == undefined)){
            _loc3_.push(_all_feizi[_loc4_]);
         }
      }
      _loc4_ += 1;
   }
   if(_loc2_.length == 0 || _loc3_.length < 3){  }
   else{
	id('剧情对话').style.display = 'block';
   var 高位妃嫔 = _loc2_[random(_loc2_.length)];
   var 被罚妃嫔 = _loc3_[1 + random(_loc3_.length - 2)];
   var 受欺负的妃嫔 = _loc3_[_loc3_.length - 1];
   var 抱不平的妃嫔 = _loc3_[0];
   播放音乐("Music_33",1);
   出现这个人的头像(剧情头像,被罚妃嫔);
   剧情背景.src =LJ +  'a0aPic_BG/Tu_8837469.webp';
   对话打字效果("（" + 被罚妃嫔.封号 + 被罚妃嫔.位分 + "穿着一身新衣服，在园子里招摇过市。碰巧被路过的" + 抱不平的妃嫔.封号 + 抱不平的妃嫔.位分 + "和" + 受欺负的妃嫔.封号 + 受欺负的妃嫔.位分 + "看到了）");
   剧情对话板.onclick = function(){
      出现这个人的头像(剧情头像,受欺负的妃嫔);
      对话打字效果(受欺负的妃嫔.封号 + 受欺负的妃嫔.位分 + "：姐姐你看，那不是" + 被罚妃嫔.封号 + 被罚妃嫔.位分 + "吗？");
      剧情对话板.onclick = function(){
         var _loc2_ = 0;
         while(_loc2_ < 剧情汇总.length){
            if(剧情汇总[_loc2_]._code == 93){
               剧情汇总[_loc2_].达成 = 1;
            }
            _loc2_ += 1;
         }
         出现这个人的头像(剧情头像,抱不平的妃嫔);
         对话打字效果(抱不平的妃嫔.封号 + 抱不平的妃嫔.位分 + "：嗯，还真是，刚刚在殿里闲聊的时候，说错了话得罪了" + 高位妃嫔.封号 + 高位妃嫔.位分 + "娘娘，自己都不知道，现在还在这里张扬，不知是真傻还是装傻。");
         剧情对话板.onclick = function(){
            出现这个人的头像(剧情头像,被罚妃嫔);
            对话打字效果(被罚妃嫔.封号 + 被罚妃嫔.位分 + "：你们在说什么？（" + 被罚妃嫔.封号 + 被罚妃嫔.位分 + "发现了" + 抱不平的妃嫔.封号 + 抱不平的妃嫔.位分 + "和" + 受欺负的妃嫔.封号 + 受欺负的妃嫔.位分 + "）");
            剧情对话板.onclick = function(){
               出现这个人的头像(剧情头像,受欺负的妃嫔);
               对话打字效果(受欺负的妃嫔.封号 + 受欺负的妃嫔.位分 + "：没什么，只是感叹姐姐风一样的性格，果真是出自骁勇世家啊。");
               剧情对话板.onclick = function(){
                  出现这个人的头像(剧情头像,被罚妃嫔);
                  对话打字效果(被罚妃嫔.封号 + 被罚妃嫔.位分 + "：呵呵，那当然，我家家风向来如此。");
                  剧情对话板.onclick = function(){
                     出现这个人的头像(剧情头像,受欺负的妃嫔);
                     对话打字效果(受欺负的妃嫔.封号 + 受欺负的妃嫔.位分 + "：噗……（" + 受欺负的妃嫔.封号 + 受欺负的妃嫔.位分 + "不禁偷笑）");
                     剧情对话板.onclick = function(){
                        出现这个人的头像(剧情头像,被罚妃嫔);
                        对话打字效果(被罚妃嫔.封号 + 被罚妃嫔.位分 + "：你！你居然敢笑我！（" + 被罚妃嫔.封号 + 被罚妃嫔.位分 + "抬手就要打" + 受欺负的妃嫔.封号 + 受欺负的妃嫔.位分 + "）");
                        剧情对话板.onclick = function(){
                           出现这个人的头像(剧情头像,抱不平的妃嫔);
                           对话打字效果(抱不平的妃嫔.封号 + 抱不平的妃嫔.位分 + "：住手！她与你同为妃嫔，你怎可上手打她？（" + 抱不平的妃嫔.封号 + 抱不平的妃嫔.位分 + "拦住了" + 被罚妃嫔.封号 + 被罚妃嫔.位分 + "的手）");
                           剧情对话板.onclick = function(){
                              出现这个人的头像(剧情头像,高位妃嫔);
                              对话打字效果(高位妃嫔.封号 + 高位妃嫔.位分 + "：干什么呢？这么吵？（" + 高位妃嫔.封号 + 高位妃嫔.位分 + "从庭院里走出来）");
                              剧情对话板.onclick = function(){
                                 出现这个人的头像(剧情头像,被罚妃嫔);
                                 对话打字效果(被罚妃嫔.封号 + 被罚妃嫔.位分 + "：啊！" + 高位妃嫔.封号 + 高位妃嫔.位分 + "娘娘！");
                                 剧情对话板.onclick = function(){
                                    出现这个人的头像(剧情头像,受欺负的妃嫔);
                                    对话打字效果(受欺负的妃嫔.封号 + 受欺负的妃嫔.位分 + "：给" + 高位妃嫔.封号 + 高位妃嫔.位分 + "娘娘请安。");
                                    剧情对话板.onclick = function(){
                                       出现这个人的头像(剧情头像,抱不平的妃嫔);
                                       对话打字效果(抱不平的妃嫔.封号 + 抱不平的妃嫔.位分 + "：" + 高位妃嫔.封号 + 高位妃嫔.位分 + "娘娘万福。");
                                       剧情对话板.onclick = function(){
                                          停止音乐();
                                          播放音乐("Music_36",1);
                                          出现这个人的头像(剧情头像,高位妃嫔);
                                          对话打字效果(高位妃嫔.封号 + 高位妃嫔.位分 + "：你在这露胳膊挽袖子的想干嘛？（" + 高位妃嫔.封号 + 高位妃嫔.位分 + "冲着" + 被罚妃嫔.封号 + 被罚妃嫔.位分 + "问道）");
                                          剧情对话板.onclick = function(){
                                             出现这个人的头像(剧情头像,被罚妃嫔);
                                             对话打字效果(被罚妃嫔.封号 + 被罚妃嫔.位分 + "：" + 受欺负的妃嫔.封号 + 受欺负的妃嫔.位分 + "她出言不逊，嫔妾只是想训诫，训诫一下……");
                                             剧情对话板.onclick = function(){
                                                出现这个人的头像(剧情头像,高位妃嫔);
                                                对话打字效果(高位妃嫔.封号 + 高位妃嫔.位分 + "：呵呵，本宫不知这后宫里何时轮到你" + 被罚妃嫔.封号 + 被罚妃嫔.位分 + "当家了？要劳烦你训诫妃嫔？");
                                                剧情对话板.onclick = function(){
                                                   出现这个人的头像(剧情头像,被罚妃嫔);
                                                   对话打字效果(被罚妃嫔.封号 + 被罚妃嫔.位分 + "：嫔妾不敢了。" + 高位妃嫔.封号 + 高位妃嫔.位分 + "娘娘就饶过嫔妾这一回吧。");
                                                   剧情对话板.onclick = function(){
                                                      if(被罚妃嫔.后宫相性 == 高位妃嫔.id){
                                                         出现这个人的头像(剧情头像,高位妃嫔);
                                                         对话打字效果(高位妃嫔.封号 + 高位妃嫔.位分 + "：念在你虚心改过，这回就饶了你，罚俸三个月，下不为例。");
                                                         剧情对话板.onclick = function()
                                                         {
                                                            出现这个人的头像(剧情头像,被罚妃嫔);
                                                            对话打字效果(被罚妃嫔.封号 + 被罚妃嫔.位分 + "：谢娘娘开恩！");
                                                            剧情对话板.onclick = function()
                                                            {
                                                               出现这个人的头像(剧情头像,高位妃嫔);
                                                               对话打字效果(高位妃嫔.封号 + 高位妃嫔.位分 + "：你们也不是省油的灯，都给我回宫去，好好反省吧。");
                                                               剧情对话板.onclick = function()
                                                               {
                                                                  出现这个人的头像(剧情头像,受欺负的妃嫔);
                                                                  对话打字效果(受欺负的妃嫔.封号 + 受欺负的妃嫔.位分 + "：是……");
                                                                  剧情对话板.onclick = function()
                                                                  {
                                                                     出现这个人的头像(剧情头像,抱不平的妃嫔);
                                                                     对话打字效果(抱不平的妃嫔.封号 + 抱不平的妃嫔.位分 + "：恭送" + 高位妃嫔.封号 + 高位妃嫔.位分 + "娘娘……");
                                                                     剧情对话板.onclick = function()
                                                                     {
                                                                        停止音乐();
                                                                        id('剧情对话').style.display = 'none';
								                                        移除板子推进(id('youyuan'));
                                                                        缓动黑幕();
                                                                     };
                                                                  };
                                                               };
                                                            };
                                                         };
                                                      }
                                                      else{
                                                         出现这个人的头像(剧情头像,高位妃嫔);
                                                         对话打字效果(高位妃嫔.封号 + 高位妃嫔.位分 + "：呵……哎呀~！今年的枫叶可不够红啊。本宫听说那枫叶得染上了人的鲜血才漂亮呢。来人，就赏" + 被罚妃嫔.封号 + 被罚妃嫔.位分 + "一仗红吧。");
                                                         剧情对话板.onclick = function()
                                                         {
                                                            出现这个人的头像(剧情头像,被罚妃嫔);
                                                            对话打字效果(被罚妃嫔.封号 + 被罚妃嫔.位分 + "：啊！娘娘饶命，娘娘饶命啊！");
                                                            剧情对话板.onclick = function()
                                                            {
                                                               出现这个人的头像(剧情头像,高位妃嫔);
                                                               对话打字效果(高位妃嫔.封号 + 高位妃嫔.位分 + "：能染红皇宫里的红叶，这可是你的福分啊~！");
                                                               剧情对话板.onclick = function()
                                                               {
                                                                  对话打字效果("（皇上选择如何做？）",["无视","出面阻拦"]);
                                                                  id('剧情an0').onclick = function()
                                                                  {
                                                                     出现这个人的头像(剧情头像,被罚妃嫔);
                                                                     对话打字效果(被罚妃嫔.封号 + 被罚妃嫔.位分 + "：娘娘，嫔妾再也不敢了，娘娘饶命啊！（" + 被罚妃嫔.封号 + 被罚妃嫔.位分 + "被拉去了慎刑司）");
                                                                     剧情对话板.onclick = function()
                                                                     {
                                                                        出现这个人的头像(剧情头像,高位妃嫔);
                                                                        对话打字效果(高位妃嫔.封号 + 高位妃嫔.位分 + "：你们也不是省油的灯，都给我回宫去，好好反省吧。");
                                                                        剧情对话板.onclick = function()
                                                                        {
                                                                           出现这个人的头像(剧情头像,受欺负的妃嫔);
                                                                           对话打字效果(受欺负的妃嫔.封号 + 受欺负的妃嫔.位分 + "：是……");
                                                                           剧情对话板.onclick = function()
                                                                           {
                                                                              出现这个人的头像(剧情头像,抱不平的妃嫔);
                                                                              对话打字效果(抱不平的妃嫔.封号 + 抱不平的妃嫔.位分 + "：恭送" + 高位妃嫔.封号 + 高位妃嫔.位分 + "娘娘……");
                                                                              剧情对话板.onclick = function()
                                                                              {
                                                                                 停止音乐();
                                                                                 id('剧情对话').style.display = 'none';
								                                                 移除板子推进(id('youyuan'));
                                                                                 缓动黑幕();
																				 删除跟这个人有关的三方相性(被罚妃嫔);
																				 删除这个妃子的值(被罚妃嫔);
																				 高位妃嫔.任性 += random(10) * 高位妃嫔.野心 / 100;
                                                                                 太监说话的程序(5,"皇上，刚刚" + 高位妃嫔.封号 + 高位妃嫔.位分 + "娘娘发落了" + 被罚妃嫔.封号 + 被罚妃嫔.位分 + "，赏了一丈红，现在人已经废了。")
                                                                              };
                                                                           };
                                                                        };
                                                                     };
                                                                  };
                                                                  id('剧情an1').onclick = function()
                                                                  {
                                                                     新后宫图形读取程序(剧情头像,0,'皇帝');
                                                                     对话打字效果("皇上：好了，别吵了！" + 被罚妃嫔.封号 + 被罚妃嫔.位分 + "有错，但错不至死，你且饶过她一回吧。");
                                                                     剧情对话板.onclick = function()
                                                                     {
																		 出现这个人的头像(剧情头像,高位妃嫔);
                                                                        对话打字效果(高位妃嫔.封号 + 高位妃嫔.位分 + "：啊！皇上！" + 被罚妃嫔.封号 + 被罚妃嫔.位分 + "狂妄放肆，不能不罚。");
                                                                        剧情对话板.onclick = function()
                                                                        {
																			新后宫图形读取程序(剧情头像,0,'皇帝');
                                                                           对话打字效果("皇上：那就禁足一个月吧。");
                                                                           剧情对话板.onclick = function()
                                                                           {
                                                                              出现这个人的头像(剧情头像,被罚妃嫔);
                                                                              对话打字效果(被罚妃嫔.封号 + 被罚妃嫔.位分 + "：谢皇上！谢皇上！");
                                                                              剧情对话板.onclick = function()
                                                                              {
																				  新后宫图形读取程序(剧情头像,0,'皇帝');
                                                                                 对话打字效果("皇上：好了，都回宫去吧，朕还有事，先走了。");
                                                                                 剧情对话板.onclick = function()
                                                                                 {
                                                                                    出现这个人的头像(剧情头像,受欺负的妃嫔);
                                                                                    对话打字效果(受欺负的妃嫔.封号 + 受欺负的妃嫔.位分 + "：是……");
                                                                                    剧情对话板.onclick = function()
                                                                                    {
                                                                                       出现这个人的头像(剧情头像,抱不平的妃嫔);
                                                                                       对话打字效果(抱不平的妃嫔.封号 + 抱不平的妃嫔.位分 + "：恭送皇上，恭送" + 高位妃嫔.封号 + 高位妃嫔.位分 + "娘娘……");
                                                                                       剧情对话板.onclick = function()
                                                                                       {
                                                                                          出现这个人的头像(剧情头像,高位妃嫔);
                                                                                          对话打字效果(高位妃嫔.封号 + 高位妃嫔.位分 + "：哼！");
                                                                                          剧情对话板.onclick = function()
                                                                                          {
                                                                                             被罚妃嫔.爱 += 50 + random(50);
                                                                                             被罚妃嫔.任性 += random(10) * 被罚妃嫔.野心 / 100;
                                                                                             高位妃嫔.爱 -= 50;
                                                                                             id('剧情对话').style.display = 'none';
								                                                             移除板子推进(id('youyuan'));
                                                                                             缓动黑幕();
                                                                                             停止音乐();
                                                                                          };
                                                                                       };
                                                                                    };
                                                                                 };
                                                                              };
                                                                           };
                                                                        };
                                                                     };
                                                                  };
                                                               };
                                                            };
                                                         };
                                                      }
                                                   };
                                                };
                                             };
                                          };
                                       };
                                    };
                                 };
                              };
                           };
                        };
                     };
                  };
               };
            };
         };
      };
   };
   }
}
function 有人落水事件(){
   var _loc2_ = [];
   var _loc3_ = [];
   var _loc4_ = 0;
   while(_loc4_ < _all_feizi.length){
      if(_all_feizi[_loc4_].位分 !== "秀女" && _all_feizi[_loc4_].名字 !== undefined){
         if(_all_feizi[_loc4_].地位 >= 4 && _all_feizi[_loc4_].孕 == 0 && (_all_feizi[_loc4_].省亲 == 0 || _all_feizi[_loc4_].省亲 == undefined)){
            _loc2_.push(_all_feizi[_loc4_]);
         }
         else if(_all_feizi[_loc4_].地位 < 4 && (_all_feizi[_loc4_].省亲 == 0 || _all_feizi[_loc4_].省亲 == undefined)){
            _loc3_.push(_all_feizi[_loc4_]);
         }
      }
      _loc4_ += 1;
   }
   if(_loc2_.length == 0 || _loc3_.length == 0){}
   else{
	id('剧情对话').style.display = 'block';
   var 落水者 = _loc2_[random(_loc2_.length)];
   var 凶手 = _loc3_[random(_loc3_.length)];
   播放音乐("Music_36",1);
   出现这个人的头像(剧情头像,落水者);
   剧情背景.src =LJ +  "a0aPic_BG/Tu_10.webp";
   对话打字效果("人音：救命啊……救命啊！");
   剧情对话板.onclick = function(){
      对话打字效果("宫女：不好了，有人落水了，来人啊！来人啊！");
      剧情对话板.onclick = function(){
         落水者.病 += 4;
         var _loc2_ = 0;
         while(_loc2_ < 剧情汇总.length){
            if(剧情汇总[_loc2_]._code == 94){
               剧情汇总[_loc2_].达成 = 1;
            }
            _loc2_ += 1;
         }
         对话打字效果("（侍卫们赶紧把人救起来，发现落水的居然是" + 落水者.封号 + 落水者.位分 + "娘娘！）");
         剧情对话板.onclick = function(){
			 新后宫图形读取程序(剧情头像,0,"皇帝");
            对话打字效果("皇上：你们都是怎么当差的！赶快把" + 落水者.封号 + 落水者.位分 + "抬回宫，请太医！");
            剧情对话板.onclick = function(){
				出现这个人的头像(剧情头像,落水者);
               对话打字效果("（许久后，" + 落水者.封号 + 落水者.位分 + "醒了，但是依然很虚弱。）");
               剧情对话板.onclick = function(){
                  对话打字效果(落水者.封号 + 落水者.位分 + ":皇上……");
                  剧情对话板.onclick = function(){
					  新后宫图形读取程序(剧情头像,0,"皇帝");
                     对话打字效果("皇上：躺着别起来了，爱妃，你是怎么落到水里面的？");
                     剧情对话板.onclick = function(){
						 出现这个人的头像(剧情头像,落水者);
                        if(落水者.任性 > 凶手.任性 && 落水者.后宫相性 !== 凶手.id){
                           对话打字效果(落水者.封号 + 落水者.位分 + "：皇上，有人要取臣妾的性命，在臣妾身后推了一下，臣妾才落水的。您可要给臣妾做主啊！");
                           剧情对话板.onclick = function(){
							   新后宫图形读取程序(剧情头像,0,"皇帝");
                              对话打字效果("皇上：什么！你可看清是谁了吗？");
                              剧情对话板.onclick = function(){
								  出现这个人的头像(剧情头像,落水者);
                                 对话打字效果(落水者.封号 + 落水者.位分 + "：是，臣妾看得真真的，是" + 凶手.封号 + 凶手.位分 + "宫里的小太监。是" + 凶手.封号 + 凶手.位分 + "要杀了臣妾啊！" + 凶手.封号 + 凶手.位分 + "仗着有皇上的恩宠，向来跋扈，臣妾平日里也不敢招惹，但是臣妾终究是躲不过啊。");
                                 剧情对话板.onclick = function(){
                                    出现这个人的头像(剧情头像,凶手);
                                    对话打字效果(凶手.封号 + 凶手.位分 + "：住口！你信口雌黄，本宫从来没做过这种事情！皇上您可要明察！");
                                    剧情对话板.onclick = function(){
                                       对话打字效果("（皇上你要相信谁？）",[落水者.封号 + 落水者.位分,凶手.封号 + 凶手.位分]);
                                       id('剧情an0').onclick = function(){
                                          落水者.爱 += 50;
                                          落水者.任性 += random(5) * 落水者.野心 / 100;
                                          相信落水者逻辑(凶手);
                                       };
                                       id('剧情an1').onclick = function(){
                                          凶手.爱 += 20;
                                          凶手.任性 += random(10) * 凶手.野心 / 100;
                                          相信凶手逻辑(落水者);
                                       };
                                    };
                                 };
                              };
                           };
                        }
                        else{
                           对话打字效果(落水者.封号 + 落水者.位分 + "：皇上……臣妾……是自己失足落水的。");
                           剧情对话板.onclick = function(){  
							   新后宫图形读取程序(剧情头像,0,"皇帝");
                              对话打字效果("皇上：是这样吗？那也太不小心了，好好养病，别到处乱跑了。");
                              剧情对话板.onclick = function(){
                                 对话打字效果(落水者.封号 + 落水者.位分 + "：是……");
                                 剧情对话板.onclick = function(){
                                    缓动黑幕();
                                    id('剧情对话').style.display = 'none';
								    移除板子推进(id('youyuan'));
                                    停止音乐();
                                 };
                              };
                           };
                        }
                     };
                  };
               };
            };
         };
      };
   };
   }
}
function 相信落水者逻辑(凶手){
	新后宫图形读取程序(剧情头像,0,"皇帝");
   对话打字效果("你这个毒妇！皇宫禁地，竟敢如此大胆！");
   剧情对话板.onclick = function(){
	   出现这个人的头像(剧情头像,凶手);
      对话打字效果(凶手.封号 + 凶手.位分 + "：皇上，不是这样的！皇上，臣妾是冤枉的！");
      剧情对话板.onclick = function(){
         对话打字效果("（皇上要如何惩罚她？）",["仅禁足","赐死"]);
         id('剧情an0').onclick = function(){
			 出现这个人的头像(剧情头像,凶手);
            凶手.爱 -= 150;
            对话打字效果(凶手.封号 + 凶手.位分 + "：皇上，臣妾真的是冤枉的啊！");
            剧情对话板.onclick = function(){
               id('剧情对话').style.display = 'none';
				移除板子推进(id('youyuan'));
               缓动黑幕();
               停止音乐();
            };
         };
         id('剧情an1').onclick = function(){
            出现这个人的头像(剧情头像,凶手);
            对话打字效果(凶手.封号 + 凶手.位分 + "：皇上，为什么不相信臣妾？！何以如此狠心？怎么就不顾及多年情分啊！那个妖女狐媚惑主，皇上早晚会被她害死的！皇上……皇上……");
            删除跟这个人有关的三方相性(凶手);
            删除这个妃子的值(凶手);
            剧情对话板.onclick = function(){
               id('剧情对话').style.display = 'none';
				移除板子推进(id('youyuan'));
               缓动黑幕();
               停止音乐();
            };
         };
      };
   };
}
function 相信凶手逻辑(落水者){
	新后宫图形读取程序(剧情头像,0,"皇帝");
   对话打字效果(落水者.封号 + 落水者.位分 + "，朕也觉得是你在妄加猜测，甚至是在栽赃陷害！");
   剧情对话板.onclick = function(){
	   出现这个人的头像(剧情头像,落水者);
      对话打字效果(落水者.封号 + 落水者.位分 + "：皇上，皇上，臣妾难道不要命了吗？臣妾……呜呜呜……");
      剧情对话板.onclick = function(){
         对话打字效果("（皇上要如何惩罚她？）",["罚俸","禁足"]);
         id('剧情an0').onclick = function(){
            落水者.爱 -= 50;
            对话打字效果(落水者.封号 + 落水者.位分 + "：皇上，怎么能不相信臣妾？！");
            剧情对话板.onclick = function(){
               id('剧情对话').style.display = 'none';
				移除板子推进(id('youyuan'));
               缓动黑幕();
               停止音乐();
            };
         };
         id('剧情an1').onclick = function(){
            对话打字效果(落水者.封号 + 落水者.位分 + "：皇上，为什么不相信臣妾？！后宫留着那个贱人，嫔妃子嗣迟早都要被她害死的啊！皇上……皇上……");
            落水者.爱 -= 100;
            剧情对话板.onclick = function(){
               id('剧情对话').style.display = 'none';
			   移除板子推进(id('youyuan'));
               缓动黑幕();
               停止音乐();
            };
         };
      };
   };
}
function 长街掌嘴事件(){
	var _loc2_ = [];
	   var _loc3_ = [];
	   var _loc4_ = 0;
	   while(_loc4_ < _all_feizi.length){
	      if(_all_feizi[_loc4_].名字 !== undefined){
	         if(_all_feizi[_loc4_].地位 <= 3 && _all_feizi[_loc4_].位分 !== "秀女" && _all_feizi[_loc4_].地位 !== 0 && (_all_feizi[_loc4_].省亲 == 0 || _all_feizi[_loc4_].省亲 == undefined)){
	            _loc2_.push(_all_feizi[_loc4_]);
	         }
	      }
	      _loc4_ += 1;
	   }
	   if(_loc2_.length !== 0){var 罚人者 = _loc2_[random(_loc2_.length)];
	   _loc4_ = 0;
	   while(_loc4_ < _all_feizi.length){
	      if(_all_feizi[_loc4_].名字 !== undefined){
	         if(_all_feizi[_loc4_].地位 > 4 && _all_feizi[_loc4_].位分 != "秀女" && _all_feizi[_loc4_].孕 == 0 && (_all_feizi[_loc4_].省亲 == 0 || _all_feizi[_loc4_].省亲 == undefined)){
	            _loc3_.push(_all_feizi[_loc4_]);
	         }
	      }
	      _loc4_ += 1;
	   }
	   }
	   if(_loc2_.length !== 0 && _loc3_.length !== 0){
		   var 被罚者 = _loc3_[random(_loc3_.length)];
		  id('剧情对话').style.display = 'block';
	      播放音乐("Music_17",1);
	      出现这个人的头像(剧情头像,被罚者);
		  剧情背景.src =LJ +  'a0aPic_BG/Tu_8837469.webp';
	      对话打字效果(被罚者.封号 + 被罚者.位分 + "：哈~哈~快点走。不然要来不及给皇后请安了。");
	      剧情对话板.onclick = function(){
	         对话打字效果("（" + 被罚者.封号 + 被罚者.位分 + "在长街上急跑）");
	         剧情对话板.onclick = function(){
	            var _loc2_ = 0;
	            while(_loc2_ < 剧情汇总.length){
	               if(剧情汇总[_loc2_]._code == 92){
	                  剧情汇总[_loc2_].达成 = 1;
	               }
	               _loc2_ += 1;
	            }
	            出现这个人的头像(剧情头像,被罚者);
	            战斗震屏程序();
	            对话打字效果(被罚者.封号 + 被罚者.位分 + "：啊！");
	            剧情对话板.onclick = function(){
	               出现这个人的头像(剧情头像,罚人者);
	               对话打字效果(罚人者.封号 + 罚人者.位分 + "：干什么呢！走路也不看着点！想被罚是不是？");
	               剧情对话板.onclick = function(){
	                  对话打字效果("（" + 被罚者.封号 + 被罚者.位分 + "跑得太快，没看到从侧门出来的" + 罚人者.封号 + 罚人者.位分 + "，不小心撞到了）");
	                  剧情对话板.onclick = function(){
	                     出现这个人的头像(剧情头像,被罚者);
	                     对话打字效果(被罚者.封号 + 被罚者.位分 + "：嫔妾着急赶路，只是无心之失。请娘娘让路。");
	                     剧情对话板.onclick = function(){
	                        停止音乐();
	                        播放音乐("Music_18",1);
	                        出现这个人的头像(剧情头像,罚人者);
	                        对话打字效果(罚人者.封号 + 罚人者.位分 + "：无心？这会儿才来给皇后请安，早就散了！还目无尊卑，让本宫给你让路？");
	                        剧情对话板.onclick = function(){
	                           出现这个人的头像(剧情头像,被罚者);
	                           对话打字效果(被罚者.封号 + 被罚者.位分 + "：大家都是侍奉皇上的嫔妃，" + 罚人者.封号 + 罚人者.位分 + "娘娘又何必苦苦相逼呢。");
	                           剧情对话板.onclick = function(){
	                              出现这个人的头像(剧情头像,罚人者);
	                              对话打字效果(罚人者.封号 + 罚人者.位分 + "：平日里看你那狐媚惑主的样子已经忍你够久的了，还敢跟本宫讲条件？刚刚是个" + 被罚者.位分 + "就这般恃宠而骄，往后这后宫还不翻了天？翠熙，掌她的嘴。");
	                              剧情对话板.onclick = function(){
	                                 新后宫图形读取程序(剧情头像,35,"特殊");
	                                 对话打字效果("宫女：娘娘，" + 被罚者.封号 + 被罚者.位分 + "得到的恩宠颇多，皇上似乎很看重她，咱们跟她过不去，那不就是跟皇上过不去吗？");
	                                 剧情对话板.onclick = function(){
	                                    if(被罚者.后宫相性 == 罚人者.id){
	                                       出现这个人的头像(剧情头像,罚人者);
	                                       对话打字效果(罚人者.封号 + 罚人者.位分 + "：哼，今儿就先饶了你，赶紧回去思过吧，皇后那儿早就散了。");
	                                       剧情对话板.onclick = function(){
	                                          出现这个人的头像(剧情头像,被罚者);
	                                          对话打字效果(被罚者.封号 + 被罚者.位分 + "：是。");
	                                          剧情对话板.onclick = function(){
	                                             id('剧情对话').style.display = 'none';
	                                             缓动黑幕();
	                                             停止音乐();
	                                          };
	                                       };
	                                    }
	                                    else{
	                                       出现这个人的头像(剧情头像,罚人者);
	                                       对话打字效果(罚人者.封号 + 罚人者.位分 + "：本宫让你打你就打！本宫居" + 罚人者.位分 + "位，还罚不了一个" + 被罚者.位分 + "吗？");
	                                       剧情对话板.onclick = function(){
	                                          新后宫图形读取程序(剧情头像,35,"特殊");
	                                          对话打字效果("宫女：是……（皇上是否出面？）",["无视","出面阻拦"]);
	                                         id('剧情an0').onclick = function(){
	                                             对话打字效果("宫女：" + 被罚者.封号 + 被罚者.位分 + "，对不住了。");
	                                             剧情对话板.onclick = function(){
	                                                出现这个人的头像(剧情头像,被罚者);
	                                                对话打字效果("（宫女不停的扇" + 被罚者.封号 + 被罚者.位分 + "的耳光，" + 被罚者.封号 + 被罚者.位分 + "的脸明显肿了起来）");
	                                                剧情对话板.onclick = function(){
	                                                   出现这个人的头像(剧情头像,罚人者);
	                                                   对话打字效果(罚人者.封号 + 罚人者.位分 + "：好了，别打了。本宫没空在这陪你。翠熙，你在这看着她，让她跪上半个时辰再起来，本宫先回宫了。");
	                                                   剧情对话板.onclick = function(){
	                                                      出现这个人的头像(剧情头像,被罚者);
	                                                      对话打字效果(被罚者.封号 + 被罚者.位分 + "：………………（" + 被罚者.封号 + 被罚者.位分 + 被罚者.名字 + "相貌下降）");
	                                                      剧情对话板.onclick = function(){
	                                                         被罚者.魅力 -= 5;
	                                                         被罚者.爱 -= random(50);
	                                                         罚人者.任性 += random(5) * 罚人者.野心 / 100;
	                                                         id('剧情对话').style.display = 'none';
	                                                         缓动黑幕();
	                                                         停止音乐();
	                                                      };
	                                                   };
	                                                };
	                                             };
	                                          };
	                                          id('剧情an1').onclick = function(){
												新后宫图形读取程序(剧情头像,0,"皇帝");
	                                             对话打字效果("皇上：住手。");
	                                             剧情对话板.onclick = function(){
	                                                出现这个人的头像(剧情头像,罚人者);
	                                                对话打字效果(罚人者.封号 + 罚人者.位分 + "：皇上？！");
	                                                剧情对话板.onclick = function(){
														新后宫图形读取程序(剧情头像,0,"皇帝");
	                                                   对话打字效果("皇上：这件事就到此为止吧。" + 被罚者.封号 + 被罚者.位分 + "她也没什么大错，何必这样呢。好了，都回宫歇着吧。");
	                                                   剧情对话板.onclick = function(){
	                                                      出现这个人的头像(剧情头像,被罚者);
	                                                      对话打字效果(被罚者.封号 + 被罚者.位分 + "：谢皇上……");
	                                                      剧情对话板.onclick = function(){
	                                                         罚人者.爱 -= random(20);
	                                                         被罚者.任性 += random(3) * 被罚者.野心 / 100;
	                                                         被罚者.爱 += random(10);
	                                                         id('剧情对话').style.display = 'none';
	                                                         缓动黑幕();
	                                                         停止音乐();
	                                                      };
	                                                   };
	                                                };
	                                             };
	                                          };
	                                       };
	                                    }
	                                 };
	                              };
	                           };
	                        };
	                     };
	                  };
	               };
	            };
	         };
	      };
	   }
}
function 皇子调戏庶母事件(){
	   var _loc2_ = [];
	   var _loc3_ = [];
	   var _loc4_ = 0;
	   while(_loc4_ < _all_child.length){
	      if(_all_child[_loc4_].年龄 >= 16&&_all_child[_loc4_].性别 == 0&&_all_child[_loc4_].状态 == 0&&_all_child[_loc4_].婚 !== 1&&_all_child[_loc4_].智力 < 70&&_all_child[_loc4_].文质 < 80){
	         _loc2_.push(_all_child[_loc4_]);
	      }
	      _loc4_ += 1;
	   }
	   if(_loc2_.length !== 0){
		  var 倒霉皇子 = _loc2_[random(_loc2_.length)];
		  var _loc5_ = 0;
		  while(_loc5_ < _all_feizi.length){
		     if(_all_feizi[_loc5_].名字 !== undefined){
		        if(_all_feizi[_loc5_].性别 == 1&&_all_feizi[_loc5_].年龄 <= 倒霉皇子.年龄&&_all_feizi[_loc5_].孕 == 0&&(_all_feizi[_loc5_].省亲 == 0||_all_feizi[_loc5_].省亲 == undefined)&&_all_feizi[_loc5_].皇嗣相性 !== 倒霉皇子.id){
		           _loc3_.push(_all_feizi[_loc5_]);
		        }
		     }
		     _loc5_ += 1;
		  }
		  _loc5_ = 0;
		  while(_loc5_ < _all_feizi.length){
		     if(_all_feizi[_loc5_].名字 == 倒霉皇子.母亲&&(_all_feizi[_loc5_].省亲 == 0||_all_feizi[_loc5_].省亲 == undefined)){
		        var 倒霉生母 = _all_feizi[_loc5_];
		     }
		     _loc5_ += 1;
		  }
		}
	   if(!(_loc2_.length == 0||_loc3_.length == 0||倒霉生母 == undefined)){
		  var 倒霉妃子 = _loc3_[random(_loc3_.length)];
	      id('剧情对话').style.display = 'block';
	      播放音乐("Music_18",1);
	      出现这个人的头像(剧情头像,倒霉皇子);
	      新后宫图形读取程序(剧情背景,394875,"背景");
	      对话打字效果(倒霉皇子.名称 + "：你别走！你已经故意远离我好几次了！");
	      剧情对话板.onclick = function(){
	         出现这个人的头像(剧情头像,倒霉妃子);
	         对话打字效果(倒霉妃子.封号 + 倒霉妃子.位分 + "：殿下，我们还是相互远离比较好，免得坏了各自清誉。");
	         剧情对话板.onclick = function(){
	            出现这个人的头像(剧情头像,倒霉皇子);
	            对话打字效果(倒霉皇子.名称 + "：可是我明明对你真心真意，你为什么就不肯接受？！");
	            剧情对话板.onclick = function(){
	               出现这个人的头像(剧情头像,倒霉妃子);
	               对话打字效果(倒霉妃子.封号 + 倒霉妃子.位分 + "：殿下！我可是你的庶母！！");
	               剧情对话板.onclick = function(){
	                  出现这个人的头像(剧情头像,倒霉皇子);
	                  对话打字效果(倒霉皇子.名称 + "：我不在乎！自从第一次相遇我就已经爱上你了，不可自拔。而且父皇他已经老了，跟我走吧！");
	                  剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
	                     对话打字效果("你们！太让我震惊和失望了！一个皇子，居然敢惦记朕的女人。还有你这个贱婢，勾引皇子，是想怂恿他篡朕的皇位吗？");
	                     剧情对话板.onclick = function(){出现这个人的头像(剧情头像,倒霉皇子);
	                        对话打字效果(倒霉皇子.名称 + "：父皇！是儿臣一心喜欢" + 倒霉妃子.封号 + 倒霉妃子.位分 + "的，虽然她一直拒绝儿臣，儿臣不甘心，但真的不是她勾引儿臣的。");
	                        剧情对话板.onclick = function(){
	                           出现这个人的头像(剧情头像,倒霉生母);
	                           对话打字效果(倒霉生母.封号 + 倒霉生母.位分 + "：皇上，" + 倒霉皇子.名称 + "这孩子虽然也有不对。但是一定是那个贱人勾引在先！是她诚心要离间您和孩子的感情啊！");
	                           剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
	                              对话打字效果("够了！朕不想听你们说了……");
	                              剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"特殊");
	                                 对话打字效果("(皇上打算如何处置皇子？)",["除皇籍","禁足"]);
	                                    var _loc1_ = 0;
	                                    while(_loc1_ < 剧情汇总.length){
	                                       if(剧情汇总[_loc1_]._code == 95){
	                                          剧情汇总[_loc1_].达成 = 1;
	                                       }
	                                       _loc1_ += 1;
	                                    }
	                                    id("剧情an1").onclick = function(){
	                                       倒霉皇子.智力 -= 10;
	                                       倒霉生母.爱 -= 100;
	                                       处理绯闻庶母(倒霉皇子,倒霉妃子,倒霉生母);
	                                    };
	                                    id("剧情an0").onclick = function(){
	                                       倒霉生母.生育 -= 1;
	                                       倒霉皇子.状态 = 2;
	                                       删除跟这个人有关的三方相性(倒霉皇子);
	                                       处理绯闻庶母(倒霉皇子,倒霉妃子,倒霉生母);
	                                    };
	                              };
	                           };
	                        };
	                     };
	                  };
	               };
	            };
	         };
	      };
	   }
	   else{
		   移除板子推进(id('youyuan'));
	   }
}
function 处理绯闻庶母(倒霉皇子,倒霉妃子,倒霉生母){
	缓动黑幕();
   出现这个人的头像(剧情头像,倒霉妃子);
   对话打字效果("(皇上打算如何处置妃子?)",["赐死","禁足"]);
   id("剧情an1").onclick = function(){
      倒霉妃子.爱 -= 20;
      出现这个人的头像(剧情头像,倒霉皇子);
      对话打字效果(倒霉皇子.名称 + "：父皇！儿臣知道错了，请您饶过儿臣吧！父皇……！");
      剧情对话板.onclick = function(){
         出现这个人的头像(剧情头像,倒霉妃子);
         对话打字效果(倒霉妃子.封号 + 倒霉妃子.位分 + "：皇上！臣妾冤枉啊！");
         剧情对话板.onclick = function(){
            出现这个人的头像(剧情头像,倒霉生母);
            对话打字效果(倒霉生母.封号 + 倒霉生母.位分 + "：皇上！求您饶恕" + 倒霉皇子.名称 + "吧。他还小，他是受贱人勾引的……");
            剧情对话板.onclick = function(){
               id('剧情对话').style.display = 'none';
			   移除板子推进(id('youyuan'));
               缓动黑幕();
               停止音乐();
            };
         };
      };
   };
   id("剧情an0").onclick = function(){
      删除跟这个人有关的三方相性(倒霉妃子);
      删除这个妃子的值(倒霉妃子);
      出现这个人的头像(剧情头像,倒霉皇子);
      对话打字效果(倒霉皇子.名称 + "：父皇！儿臣知道错了，请您饶过儿臣吧！父皇……！");
      剧情对话板.onclick = function(){
         出现这个人的头像(剧情头像,倒霉妃子);
         对话打字效果(倒霉妃子.封号 + 倒霉妃子.位分 + "：皇上！臣妾冤枉啊！");
         剧情对话板.onclick = function(){
            出现这个人的头像(剧情头像,倒霉生母);
            对话打字效果(倒霉生母.封号 + 倒霉生母.位分 + "：皇上！求您饶恕" + 倒霉皇子.名称 + "吧。他还小，他是受贱人勾引的……");
            剧情对话板.onclick = function(){
               id('剧情对话').style.display = 'none';
               缓动黑幕();移除板子推进(id('youyuan'));
               停止音乐();
            };
         };
      };
   };
}
function 男宠腹中有胎像(对象){
   var _loc2_ = 0;
   while(_loc2_ < 剧情汇总.length){
      if(剧情汇总[_loc2_]._code == 97){
         剧情汇总[_loc2_].达成 = 1;
      }
      _loc2_ += 1;
   }
   播放音乐("Music_29",1);
   id('剧情对话').style.display = 'block';
   出现这个人的头像(剧情头像,对象);
   var _loc3_ = 计算背景程序(对象);
   剧情背景.src= _loc3_;
   if(对象.爱 < 150&&对象._code >= 4000&&对象._code <= 4999){
      对话打字效果(对象.名字 + "：啊，好痛……。");
      剧情对话板.onclick = function(){
         对话打字效果("皇上：怎么了？爱妃哪里不适？快传太医过来看看。");
         剧情对话板.onclick = function(){
            对话打字效果("（稍顷，太医前来给娘娘把脉……）");
            剧情对话板.onclick = function(){
               对话打字效果("太医：恭喜皇上，恭喜娘娘！娘娘虽为男儿身却已经怀有子嗣。看来上天也被皇上与娘娘的真爱所感动，这真是天降圣童啊！");
               剧情对话板.onclick = function(){
                  对话打字效果(对象.名字 + "：什么？！！老头子，赶紧开服药把孩子打掉！！");
                  剧情对话板.onclick = function(){
                     对话打字效果("皇上：别瞎说！这可是上天赐给我们的孩子，爱妃你就认了吧。来人，好好看好" + 对象.封号 + 对象.位分 + "，不得有半点差池。");
                     剧情对话板.onclick = function(){
                        id('剧情对话').style.display = 'none';
                        停止音乐();
                     };
                  };
               };
            };
         };
      };
   }
   else{
      对话打字效果(对象.名字 + "：皇上，好像……。");
      剧情对话板.onclick = function(){
         对话打字效果("怎么了？爱妃哪里不适？快传太医过来看看。");
         剧情对话板.onclick = function(){
            对话打字效果("（稍顷，太医前来给娘娘把脉……）");
            剧情对话板.onclick = function(){
               对话打字效果("太医：恭喜皇上，恭喜娘娘！娘娘虽为男儿身却已经怀有子嗣。看来上天也被皇上与娘娘的真爱所感动，这真是天降圣童啊！");
               剧情对话板.onclick = function(){
                  对话打字效果(对象.名字 + "：真的吗？太好了！这下我就算拼了命也一定为皇上生下这个孩子！");
                  剧情对话板.onclick = function(){
                     id('剧情对话').style.display = 'none';
                     停止音乐();
                  };
               };
            };
         };
      };
   }
}
function 怀疑小产有人陷害事件(谁小产,谁陷害){
   var _loc2_ = 0;
   while(_loc2_ < 剧情汇总.length){
      if(剧情汇总[_loc2_]._code == 91){
         剧情汇总[_loc2_].达成 = 1;
      }
      _loc2_ += 1;
   }
   播放音乐("Music_18",1);
   id('剧情对话').style.display = 'block';
   出现这个人的头像(剧情头像,谁小产);
   var _loc3_ = 计算背景程序(谁小产);
   剧情背景.src=_loc3_;
   对话打字效果(谁小产.封号 + 谁小产.位分 + "：皇上臣妾的孩子没了~！嘤嘤");
   剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
      对话打字效果("皇上：别伤心了，咱们还会有孩子的。这怎么好端端的会小产呢？");
      剧情对话板.onclick = function(){出现这个人的头像(剧情头像,谁小产);
         对话打字效果(谁小产.封号 + 谁小产.位分 + "：皇上，您可要给臣妾做主啊。");
         剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
            对话打字效果("皇上：到底怎么回事？太医，" + 谁小产.封号 + 谁小产.位分 + "到底是因为什么小产的？");
            剧情对话板.onclick = function(){
               新后宫图形读取程序(剧情头像,38,"特殊");
               对话打字效果("太医：皇上，娘娘胎像一向很平稳，是不会轻易小产的。");
               剧情对话板.onclick = function(){
                  var _loc1_ = random(4);
                  if(_loc1_ == 0){
                     因为什么小产(谁小产,谁陷害,0);
                  }
                  else if(_loc1_ == 1){
                     因为什么小产(谁小产,谁陷害,1);
                  }
                  else if(_loc1_ == 2){
                     因为什么小产(谁小产,谁陷害,2);
                  }
                  else if(_loc1_ == 3){
                     因为什么小产(谁小产,谁陷害,3);
                  }
               };
            };
         };
      };
   };
}
function 因为什么小产(谁小产,谁陷害,参数){
   新后宫图形读取程序(剧情头像,38,"特殊");
   if(参数 == 0){
      对话打字效果("太医：但是，今日娘娘食用了一盘点心，这盘点心里掺有大量夹竹桃，这可是伤胎的利器啊。所以娘娘才会突然小产。");
   }
   else if(参数 == 1){
      对话打字效果("太医：但是，今日娘娘受到过猛烈撞击，加上惊吓。所以娘娘才会突然小产。");
   }
   else if(参数 == 2){
      对话打字效果("太医：但是，今日娘娘受到过猛烈颠簸，动了胎气。所以娘娘才会突然小产。");
   }
   else if(参数 == 3){
      对话打字效果("太医：但是，近日娘娘经常涂抹一种叫做舒痕胶的美容品，其中含有大量麝香，那可是伤胎的利器啊。所以娘娘才会突然小产。");
   }
   剧情对话板.onclick = function(){
      新后宫图形读取程序(剧情头像,35,"特殊");
      if(参数 == 0){
         对话打字效果("宫女：皇上，" + 谁陷害.封号 + 谁陷害.位分 + "娘娘今天差人送了这盘点心给我家娘娘吃，娘娘吃了以后就感觉身体不适，后来就小产了。");
      }
      else if(参数 == 1){
         对话打字效果("宫女：皇上，今天我家娘娘在园子里散步，恰巧碰到" + 谁陷害.封号 + 谁陷害.位分 + "娘娘带了一只猫在玩，后来那只猫突然朝我家娘娘扑过来，猛地撞到娘娘，后来就小产了。那只猫必定经过训练。");
      }
      else if(参数 == 2){
         对话打字效果("宫女：皇上，今天我家娘娘坐着轿辇经过" + 谁陷害.封号 + 谁陷害.位分 + "娘娘宫外，谁知那条路上平白多出许多光滑的鹅卵石，轿夫一个不小心，踩到了鹅卵石滑倒了，我家娘娘就摔了下来，后来就小产了。");
      }
      else if(参数 == 3){
         对话打字效果("宫女：皇上，那舒痕胶本是" + 谁陷害.封号 + 谁陷害.位分 + "差人送来的，说是能美容养颜，我家娘娘就每天都用，谁知那东西有毒，后来就小产了。");
      }
      剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
         对话打字效果("皇上：传" + 谁陷害.封号 + 谁陷害.位分 + "。");
         剧情对话板.onclick = function(){
            出现这个人的头像(剧情头像,谁陷害);
            对话打字效果(谁陷害.封号 + 谁陷害.位分 + "：皇上金安。");
            剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
               if(参数 == 0){
                  对话打字效果("皇上：嗯。" + 谁陷害.封号 + 谁陷害.位分 + "，" + 谁小产.封号 + 谁小产.位分 + "的孩子没了，说是因为吃了你送来的带有夹竹桃的点心，你可有什么话说？");
               }
               else if(参数 == 1){
                  对话打字效果("皇上：嗯。" + 谁陷害.封号 + 谁陷害.位分 + "，" + 谁小产.封号 + 谁小产.位分 + "的孩子没了，说是因为你的猫撞到了她，你可有什么话说？");
               }
               else if(参数 == 2){
                  对话打字效果("皇上：嗯。" + 谁陷害.封号 + 谁陷害.位分 + "，" + 谁小产.封号 + 谁小产.位分 + "的孩子没了，说是因为经过你宫门口时，平白多了很多鹅卵石，从轿辇上摔了下来，你可有什么话说？");
               }
               else if(参数 == 3){
                  对话打字效果("皇上：嗯。" + 谁陷害.封号 + 谁陷害.位分 + "，" + 谁小产.封号 + 谁小产.位分 + "的孩子没了，说是因为用了你送来的含有麝香的舒痕胶，你可有什么话说？");
               }
               剧情对话板.onclick = function(){出现这个人的头像(剧情头像,谁陷害);
                  if(参数 == 0){
                     对话打字效果(谁陷害.封号 + 谁陷害.位分 + "：皇上，臣妾是好心送来点心，原料绝对没有问题，皇嗣为重，臣妾就是有十个胆也不敢加害怀孕的" + 谁小产.封号 + 谁小产.位分 + "啊。小产真是因为这个原因吗？皇上想想，臣妾如果要害" + 谁小产.封号 + 谁小产.位分 + "，那这手段未免也太明显了吧？");
                  }
                  else if(参数 == 1){
                     对话打字效果(谁陷害.封号 + 谁陷害.位分 + "：皇上，出了这种事，臣妾也洗脱不了，但是要说加害皇嗣，臣妾就是有十个胆也不敢啊。小产真是因为这个原因吗？皇上想想，臣妾如果要害" + 谁小产.封号 + 谁小产.位分 + "，那这手段未免也太明显了吧？");
                  }
                  else if(参数 == 2){
                     对话打字效果(谁陷害.封号 + 谁陷害.位分 + "：皇上，臣妾今日都没碰到过" + 谁小产.封号 + 谁小产.位分 + "，只是因为她经过了臣妾宫门口就要赖上臣妾吗？小产真是因为这个原因吗？皇上想想，臣妾如果要害" + 谁小产.封号 + 谁小产.位分 + "，那在我自己宫门口放鹅卵石不是太容易让人怀疑我自己吗？");
                  }
                  else if(参数 == 3){
                     对话打字效果(谁陷害.封号 + 谁陷害.位分 + "：皇上，臣妾是好心送来美容品，原料绝对没有问题，皇嗣为重，臣妾就是有十个胆也不敢加害怀孕的" + 谁小产.封号 + 谁小产.位分 + "啊。小产真是因为这个原因吗？皇上想想，臣妾如果要害" + 谁小产.封号 + 谁小产.位分 + "，那这手段未免也太明显了吧？");
                  }
                  剧情对话板.onclick = function(){
                     出现这个人的头像(剧情头像,谁小产);
                     对话打字效果(谁小产.封号 + 谁小产.位分 + "：皇上，这招虽然危险，但是一旦成功，不论皇上相信谁，臣妾的孩子始终是保不住了啊。");
                     剧情对话板.onclick = function(){
                        对话打字效果("（说得都有道理，怎么办呢？）",["都不罚","罚" + 谁陷害.封号 + 谁陷害.位分,"罚" + 谁小产.封号 + 谁小产.位分]);
                        id("剧情an2").onclick = function(){
                           新后宫图形读取程序(剧情头像,0,"皇帝");
                           if(参数 == 0){
                              对话打字效果("皇上：" + 谁陷害.封号 + 谁陷害.位分 + "说的在理，谁也不会用这么明显的手段陷害怀有皇嗣的嫔妃，" + 谁小产.封号 + 谁小产.位分 + "，看在你刚刚小产，朕就不严惩你诬告之罪了，禁足1个月，好好养身子吧。");
                           }
                           else if(参数 == 1){
                              对话打字效果("皇上：" + 谁陷害.封号 + 谁陷害.位分 + "说的在理，谁也不会用这么明显的手段陷害怀有皇嗣的嫔妃，" + 谁小产.封号 + 谁小产.位分 + "，看在你刚刚小产，就不要胡思乱想了，也别到处乱跑，禁足1个月，待在自己宫里，好好养身子吧。");
                           }
                           else if(参数 == 2){
                              对话打字效果("皇上：" + 谁陷害.封号 + 谁陷害.位分 + "说的在理，她怎么能料到你会经过她宫门口而提前做手脚呢，" + 谁小产.封号 + 谁小产.位分 + "，看在你刚刚小产，就不要胡思乱想了，也别到处乱跑，禁足1个月，待在自己宫里，好好养身子吧。");
                           }
                           else if(参数 == 3){
                              对话打字效果("皇上：" + 谁陷害.封号 + 谁陷害.位分 + "说的在理，谁也不会用这么明显的手段陷害怀有皇嗣的嫔妃，" + 谁小产.封号 + 谁小产.位分 + "，看在你刚刚小产，朕就不严惩你诬告之罪了，禁足1个月，好好养身子吧。");
                           }
                           剧情对话板.onclick = function(){出现这个人的头像(剧情头像,谁小产);
                              对话打字效果(谁小产.封号 + 谁小产.位分 + "：皇上，怎么能不相信臣妾，臣妾怎么会拿自己肚子里的孩子开玩笑呢？这明显是有人要害死臣妾的孩子啊！皇上……");
                              剧情对话板.onclick = function(){
                                 出现这个人的头像(剧情头像,谁陷害);
                                 对话打字效果(谁陷害.封号 + 谁陷害.位分 + "：就算是这样，那也不会是本宫，也许本宫才是被陷害的人呢。");
                                 剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                    对话打字效果("皇上：好了，都别吵了，既然都怀疑是有人陷害，那就派人去查吧，查得出查不出的，你们也都别吵了。");
                                    剧情对话板.onclick = function(){
                                       谁小产.爱 -= 100;
                                       谁陷害.任性 += random(10) * 谁陷害.野心 / 100;
                                       谁陷害.爱 += 50;
                                       id('剧情对话').style.display = 'none';
                                       缓动黑幕();
                                       停止音乐();
                                    };
                                 };
                              };
                           };
                        };
                        id("剧情an1").onclick = function(){
                           新后宫图形读取程序(剧情头像,0,"皇帝");
                           对话打字效果("皇上：" + 谁小产.封号 + 谁小产.位分 + "说的在理，毕竟谁也不会拿自己肚子里的孩子开玩笑。");
                           剧情对话板.onclick = function(){
                              出现这个人的头像(剧情头像,谁陷害);
                              if(参数 == 0){
                                 对话打字效果(谁陷害.封号 + 谁陷害.位分 + "：请皇上明察。那夹竹桃也许是她自己下的呢？皇上，这后宫之中亲手杀死襁褓中的孩子陷害他人的事情也不是没有，臣妾真的是冤枉啊！");
                              }
                              else if(参数 == 1){
                                 对话打字效果(谁陷害.封号 + 谁陷害.位分 + "：请皇上明察。撞击？就算是猫撞了她，有那么大力道吗？也许是她自己先撞在哪里了。皇上，这后宫之中亲手杀死襁褓中的孩子陷害他人的事情也不是没有，臣妾真的是冤枉啊！");
                              }
                              else if(参数 == 2){
                                 对话打字效果(谁陷害.封号 + 谁陷害.位分 + "：请皇上明察。怎么那么巧她经过臣妾宫门口就出事了？臣妾没逼她非要从那里走啊。皇上，这后宫之中亲手杀死襁褓中的孩子陷害他人的事情也不是没有，臣妾真的是冤枉啊！");
                              }
                              else if(参数 == 3){
                                 对话打字效果(谁陷害.封号 + 谁陷害.位分 + "：请皇上明察。那麝香也许是她自己下的呢？皇上，这后宫之中亲手杀死襁褓中的孩子陷害他人的事情也不是没有，臣妾真的是冤枉啊！");
                              }
                              剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                 对话打字效果("皇上：朕已经不想听你的说辞了。");
                                 剧情对话板.onclick = function(){
                                    对话打字效果("（皇上要如何惩罚她？）",["罚俸","禁足","赐死"]);
                                    id("剧情an2").onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                       对话打字效果("皇上：" + 谁陷害.封号 + 谁陷害.位分 + "，你心肠歹毒，平时嚣张跋扈也就算了，今日居然也敢害死皇嗣了，朕实在不能容你这祸害了，来人，拖出去，赐自尽。");
                                       剧情对话板.onclick = function(){出现这个人的头像(剧情头像,谁陷害);
                                          对话打字效果(谁陷害.封号 + 谁陷害.位分 + "：皇上，臣妾真的冤枉啊。");
                                          剧情对话板.onclick = function(){
                                             谁小产.爱 += 50;
                                             谁小产.任性 += random(10) * 谁小产.野心 / 100;
                                             删除跟这个人有关的三方相性(谁陷害);
                                             删除这个妃子的值(谁陷害);
                                             id('剧情对话').style.display = 'none';
                                             缓动黑幕();
                                             停止音乐();
                                          };
                                       };
                                    };
                                    id("剧情an1").onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                       对话打字效果("皇上：传令下去，" + 谁陷害.封号 + 谁陷害.位分 + "，嚣张跋扈，从即刻起，不许踏出自己宫门半步，不得任何人探视。");
                                       剧情对话板.onclick = function(){出现这个人的头像(剧情头像,谁陷害);
                                          对话打字效果(谁陷害.封号 + 谁陷害.位分 + "：皇上，臣妾真的冤枉啊。");
                                          剧情对话板.onclick = function(){
                                             谁小产.爱 += 10;
                                             谁小产.任性 += random(10) * 谁小产.野心 / 100;
                                             谁陷害.爱 -= 200;
                                             id('剧情对话').style.display = 'none';
                                             缓动黑幕();
                                             停止音乐();
                                          };
                                       };
                                    };
                                    id("剧情an0").onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                       对话打字效果("皇上：" + 谁陷害.封号 + 谁陷害.位分 + "，不论你是否冤枉，事情总是与你有关，着罚俸三个月，好好悔过去吧。");
                                       剧情对话板.onclick = function(){
                                          出现这个人的头像(剧情头像,谁小产);
                                          对话打字效果(谁小产.封号 + 谁小产.位分 + "：皇上，就这么轻易放过害死臣妾孩子的毒妇吗。");
                                          剧情对话板.onclick = function(){
                                             谁小产.爱 -= 10;
                                             谁陷害.爱 -= 80;
                                             id('剧情对话').style.display = 'none';
                                             缓动黑幕();
                                             停止音乐();
                                          };
                                       };
                                    };
                                 };
                              };
                           };
                        };
                        id("剧情an0").onclick = function(){
							新后宫图形读取程序(剧情头像,0,"皇帝");
                           对话打字效果("皇上：你们谁都有理，这事情看来还是派人去查吧，查得出查不出结果你们也都别吵了。");
                           剧情对话板.onclick = function(){
                              对话打字效果("皇上：好了，" + 谁小产.封号 + 谁小产.位分 + "就好好养身体，其他人都回去吧。");
                              剧情对话板.onclick = function(){
                                 出现这个人的头像(剧情头像,谁陷害);
                                 对话打字效果(谁陷害.封号 + 谁陷害.位分 + "：是。");
                                 剧情对话板.onclick = function(){
                                    出现这个人的头像(剧情头像,谁小产);
                                    对话打字效果(谁小产.封号 + 谁小产.位分 + "：皇上……（流泪）");
                                    剧情对话板.onclick = function(){
                                       id('剧情对话').style.display = 'none';
                                       缓动黑幕();
                                       停止音乐();
                                    };
                                 };
                              };
                           };
                        };
                     };
                  };
               };
            };
         };
      };
   };
}
function 大臣来参见(){
   主角.大臣参见 = 1;
   var _loc4_ = [];
   var _loc2_ = 0;
   while(_loc2_ < _all_rencai.length){
      if(_all_rencai[_loc2_].关系 > 12 && (_all_rencai[_loc2_].任务中 == 0 || _all_rencai[_loc2_].任务中 == 1)){
         _loc4_.push(_all_rencai[_loc2_]);
      }
      _loc2_ = _loc2_ + 1;
   }
   if(_loc4_.length == 0){}
   else{
	   var 大臣 = _loc4_[random(_loc4_.length)];
	   id('剧情对话').style.display = 'block';
	   剧情背景.src =LJ +  'a0aPic_BG/Tu_13.webp';
	   出现这个人的头像(剧情头像,大臣);
	   对话打字效果(大臣.名字 + "：参见皇上。微臣已在此等候多时了。");
	   剧情对话板.onclick = function(){
		   新后宫图形读取程序(剧情头像,0,"皇帝");
	      对话打字效果("皇上：哦？爱卿可是有何急事？");
	      剧情对话板.onclick = function(){
	         var _loc2_ = [];
	         _loc2_.push("臣最近得到一副名画，画工及其精妙，臣想起皇上也喜欢赏玩名画，便拿来希望与皇上一同欣赏");
	         _loc2_.push("臣的友人从远方带来一种茗茶，茶香沁人心脾，十分与众不同，臣便拿来希望与皇上一同品茶");
	         _loc2_.push("最近臣闲逛于琉璃厂时发现了一件古玩，便买来希望与皇上一同赏玩");
	         _loc2_.push("最近闲来无事，写了一本诗集，臣知道皇上也是爱诗之人，特拿来请皇上品评");
	         _loc2_.push("臣最近刚得了一坛好酒，据说这可是在地下埋了几十年的好酒，特拿来希望与皇上一醉方休");
	         _loc2_.push("臣偶然得到一只玉箫，恰巧臣最近闲来无事又谱写了一首曲子，想演奏给皇上听");
	         _loc2_.push("臣最近研习剑术颇有进展，并新编了一套剑法，想与皇上切磋一二");
	         对话打字效果(大臣.名字 + "：并无急事。只是" + _loc2_[random(_loc2_.length)] + "，不知皇上可有空？");
	         出现这个人的头像(剧情头像,大臣);
			 剧情对话板.onclick = function(){
	            对话打字效果("（是否要接受邀请？）",["接受","不接受"]);
	            id('剧情an0').onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
	               对话打字效果("皇上：爱卿如有此等闲情雅致，朕哪有拒绝的理由？");
	               剧情对话板.onclick = function(){出现这个人的头像(剧情头像,大臣);
	                  对话打字效果(大臣.名字 + "：谢皇上。");
	                  剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"特殊");
	                     对话打字效果("（皇上与" + 大臣.名字 + "度过了一个愉快的午后）");
	                     剧情对话板.onclick = function(){
	                        大臣.关系 += 1;
	                        主角.当前时辰 = 主角.当前时辰 + 1;
	                        时辰推进();
	                        缓动黑幕();
	                        id('紫宸殿内').style.display = 'none'
	                        id('剧情对话').style.display = 'none';
	                     };
	                  };
	               };
	            };
	            id('剧情an1').onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
	               对话打字效果("皇上：朕今日很忙，爱卿还是择日再来吧。");
	               剧情对话板.onclick = function(){出现这个人的头像(剧情头像,大臣);
	                  对话打字效果(大臣.名字 + "：是，臣告退。");
	                  剧情对话板.onclick = function(){
	                     大臣.关系 -= 2;
	                     缓动黑幕();
	                     id('剧情对话').style.display = 'none';
	                  };
	               };
	            };
	         };
	      };
	   };
   }
}
function 大臣劝上朝(){
   主角.大臣参见 = 1;
   var _loc3_ = [];
   var _loc2_ = 0;
   while(_loc2_ < _all_rencai.length){
        if(_all_rencai[_loc2_].清廉 > 80 && _all_rencai[_loc2_].野心 < 30 && _all_rencai[_loc2_].关系 > 12 && (_all_rencai[_loc2_].任务中 == 0 || _all_rencai[_loc2_].任务中 == 1)){
        _loc3_.push(_all_rencai[_loc2_]);
        }
        _loc2_ = _loc2_ + 1;
   }
    if(_loc3_.length == 0){}
    else{
        var 大臣 = _loc3_[random(_loc3_.length)];
        id('剧情对话').style.display = 'block';
        剧情背景.src =LJ +  'a0aPic_BG/Tu_13.webp';
        出现这个人的头像(剧情头像,大臣);
        对话打字效果(大臣.名字 + "：参见皇上。微臣已在此等候多时了。");
        剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
            对话打字效果("皇上：哦？爱卿可有什么事吗？");
            剧情对话板.onclick = function(){出现这个人的头像(剧情头像,大臣);
                对话打字效果(大臣.名字 + "：皇上已经连续数月不曾上朝了，微臣特来劝谏皇上勤勉于政，励精图治。不然朝野上下恐怕有异啊！");
                剧情对话板.onclick = function(){
                  对话打字效果("（大臣来劝谏皇上上朝了，皇上打算怎么做？）",["深以为然","敷衍了事","严词驳回"]);
                  id('剧情an0').onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                     对话打字效果("皇上：爱卿敢于在朕面前劝谏，可见爱卿对朝廷忠心耿耿，爱卿之言朕深以为然，日后定当勤勉于政，励精图治。");
                     剧情对话板.onclick = function(){出现这个人的头像(剧情头像,大臣);
                        对话打字效果(大臣.名字 + "：皇上圣明。");
                        剧情对话板.onclick = function(){
                           对话打字效果("（" + 大臣.名字 + "劝谏之后便退下了）");
                           剧情对话板.onclick = function(){
                              大臣.关系 += 1;
                              主角.当前时辰 = 主角.当前时辰 + 1;
                              时辰推进();
                              缓动黑幕();
                              id('紫宸殿内').style.display = 'none'
                              id('剧情对话').style.display = 'none';
                           };
                        };
                     };
                  };
                  id('剧情an1').onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                     对话打字效果("皇上：好了好了，朕知道了，得空朕会去上朝的，你先退下吧。");
                     剧情对话板.onclick = function(){出现这个人的头像(剧情头像,大臣);
                        对话打字效果(大臣.名字 + "：这……臣告退。");
                        剧情对话板.onclick = function(){
                           大臣.关系 -= 2;
                           缓动黑幕();
                           id('剧情对话').style.display = 'none';
                        };
                     };
                  };
                  id('剧情an2').onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                     对话打字效果("皇上：放肆！朕想做什么事情，是容得你在一旁指手画脚的吗？爱卿何时变得如此胆大包天，竟敢干预天子意愿，不想活了是不是？");
                     剧情对话板.onclick = function(){出现这个人的头像(剧情头像,大臣);
                        对话打字效果(大臣.名字 + "：这……");
                        剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                           对话打字效果("皇上：这什么？还不赶紧退下！");
                           剧情对话板.onclick = function(){出现这个人的头像(剧情头像,大臣);
                              对话打字效果(大臣.名字 + "：是……");
                              剧情对话板.onclick = function(){
                                 大臣.关系 -= 10;
                                 缓动黑幕();
                                 id('剧情对话').style.display = 'none';
                              };
                           };
                        };
                     };
                  };
               };
            };
         };
   }
}
function 公主求赐婚事件(公主,驸马){
   公主.心 = 驸马.名字;
   播放音乐("Music_21",1);
   id('剧情对话').style.display = 'block';
   出现这个人的头像(剧情头像,公主);
   剧情背景.src =LJ + 'a0aPic_BG/Tu_14.webp';
   对话打字效果("皇上：" + 公主.名称 + "，有什么事情这么着急见朕啊？");
   剧情对话板.onclick = function(){
      var _loc2_ = 0;
      while(_loc2_ < 剧情汇总.length){
         if(剧情汇总[_loc2_]._code == 99){
            剧情汇总[_loc2_].达成 = 1;
         }
         _loc2_ += 1;
      }
      对话打字效果(公主.名称 + "：父皇，儿臣……儿臣要求父皇一道恩典。");
      剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
         对话打字效果("皇上：什么恩典？但说无妨。");
         剧情对话板.onclick = function(){出现这个人的头像(剧情头像,公主);
            对话打字效果(公主.名称 + "：儿臣……儿臣求父皇恩准儿臣与" + 驸马.名字 + "大人的婚事！");
            剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
               对话打字效果("皇上：这……");
               剧情对话板.onclick = function(){
                  if(驸马.武力 > 80){
                     var _loc2_ = "在林间策马的英姿";
                  }
                  else if(驸马.智力 > 80){
                     _loc2_ = "与其他大人煮酒品诗的睿智";
                  }
                  else{
                     _loc2_ = "帅气飒爽的姿容";
                  }
				  出现这个人的头像(剧情头像,公主);
                  对话打字效果(公主.名称 + "：儿臣真的十分爱慕" + 驸马.名字 + "大人，自从无意间看见他" + _loc2_ + "，儿臣就爱上他了。");
                  剧情对话板.onclick = function(){
                     对话打字效果(公主.名称 + "：虽然" + 驸马.名字 + "大人可能还不知道儿臣的心思，儿臣也不知道他是否已心有所属，但是儿臣已经爱到至深了，儿臣知道皇家女子是无法决定自己的婚姻的，所以斗胆求父皇恩准，求父皇成全！");
                     剧情对话板.onclick = function(){
                        对话打字效果("（怎么办？要赐婚吗？）",["答应赐婚","驳回请求"]);
                        id('剧情an0').onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                           对话打字效果("皇上：朕的女儿一心所属，任谁也不会拒绝，" + 驸马.名字 + "也算一表人才，配得上驸马这个头衔，那就让礼部择良辰吉日，安排你们二人成婚吧。");
                           剧情对话板.onclick = function(){出现这个人的头像(剧情头像,公主);
                              对话打字效果(公主.名称 + "：父皇真的答应了？！儿臣，谢父皇隆恩！");
                              剧情对话板.onclick = function(){
                                 进入选择公主名号(公主,驸马);
                                 缓动黑幕();
                                 id('剧情对话').style.display = 'none';
                                 停止音乐();
                              };
                           };
                        };
                        id('剧情an1').onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                           对话打字效果("皇上：朕知道你喜欢" + 驸马.名字 + "，但你并未知道" + 驸马.名字 + "的性格秉性，他或许不能给你你想要的幸福，朕也不愿看到宝贝女儿成婚后受委屈，天下好男儿有的是，等过几天让礼部安排看看有没有合适的。");
                           剧情对话板.onclick = function(){出现这个人的头像(剧情头像,公主);
                              对话打字效果(公主.名称 + "：父皇，儿臣就喜欢他！其他人儿臣都不嫁！");
                              剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                 对话打字效果("皇上：别耍小性子了，你很清楚，皇家女子不能自由选择婚姻，好了，退下吧。");
                                 剧情对话板.onclick = function(){出现这个人的头像(剧情头像,公主);
                                    对话打字效果(公主.名称 + "：呜呜呜……父皇忍心看着儿臣郁郁寡欢吗？");
                                    剧情对话板.onclick = function(){
                                       公主.关系 -= 30;
                                       缓动黑幕();
                                       id('剧情对话').style.display = 'none';
                                       停止音乐();
                                    };
                                 };
                              };
                           };
                        };
                     };
                  };
               };
            };
         };
      };
   };
}
function 女儿为情自杀(女儿){
	id('剧情对话').style.display = 'block';
   新后宫图形读取程序(剧情头像,42,"特殊");
   剧情背景.src =LJ + 'a0aPic_BG/Tu_14.webp';
   对话打字效果("太监：不好了，皇上，大事不好了。");
   剧情对话板.onclick = function(){
      对话打字效果("太监：" + 女儿.名称 + "公主得知即将出嫁的消息后，苦苦思念" + 女儿.心 + "大人，痛哭流涕，一个想不开，悬梁自尽了！");
      剧情对话板.onclick = function(){
         对话打字效果("（女儿【" + 女儿.名称 + "】为情自尽）");
         剧情对话板.onclick = function(){
            判定这个子女死亡(女儿);
            id('剧情对话').style.display = 'none';
            缓动黑幕();
         };
      };
   };
}
function 嘉宁公主不愿意联姻远嫁(){
   id('剧情对话').style.display = 'block';
   新后宫图形读取程序(剧情头像,30,"特殊");
    剧情背景.src =LJ +'a0aPic_BG/Tu_9.webp';
   对话打字效果("嘉宁：父皇，儿臣不要去联姻。");
   剧情对话板.onclick = function(){
      对话打字效果("皇上：皇家的公主早就应该有此觉悟，为了江山社稷，要以大局为重。");
      剧情对话板.onclick = function(){
         对话打字效果("嘉宁：父皇，儿臣觉得用卖女儿的方法以求国泰民安是一种十分懦弱的行为，根本谈不上江山社稷。不管我们送出去多少宗亲贵族的女儿，如果国家孱弱，外强早晚还是会打进来。");
         剧情对话板.onclick = function(){
            对话打字效果("嘉宁：儿臣不想做江山社稷的牺牲品，儿臣宁愿到前线上阵杀敌，反正都是嘉宁一条性命，嘉宁愿意替父出征，一定打它个片甲不留。");
            剧情对话板.onclick = function(){
               对话打字效果("皇上：胡闹，你都上阵杀敌了，难道我天朝上国没男人了？");
               剧情对话板.onclick = function(){
                  对话打字效果("嘉宁：反正儿臣不要和亲啦~~~>.<");
                  剧情对话板.onclick = function(){
                     对话打字效果("嘉宁：父皇要是非要让儿臣去联姻，那儿臣就半路上把使者和随从都砍了，到时候这联姻可就变成结仇了。");
                     剧情对话板.onclick = function(){
                        对话打字效果("皇上：…………………………好吧好吧，你别在给朕惹事就行了！真是的。");
                        剧情对话板.onclick = function(){
                           对话打字效果("嘉宁：嘻嘻~父皇对儿臣真好~(*^__^*) 。");
                           剧情对话板.onclick = function(){
                              缓动黑幕();
                              id('剧情对话').style.display = 'none';
                           };
                        };
                     };
                  };
               };
            };
         };
      };
   };
}
function 公主不愿意远嫁(子女,阵营数据){
   id('剧情对话').style.display = 'block';
   出现这个人的头像(剧情头像,子女);
   新后宫图形读取程序(剧情背景,9,"背景");
   对话打字效果(子女.名称 + "：父皇，儿臣不要去联姻。");
   剧情对话板.onclick = function(){
      对话打字效果("皇上：皇家的公主早就应该有此觉悟，为了江山社稷，要以大局为重。");
      剧情对话板.onclick = function(){
         对话打字效果(子女.名称 + "：父皇，是不是不喜欢儿臣，不要儿臣了啊？~(┬＿┬)");
         剧情对话板.onclick = function(){
            对话打字效果("皇上：…………");
            剧情对话板.onclick = function(){
               对话打字效果(子女.名称 + "：父皇，儿臣听说" + 阵营数据.名称 + "那个鬼地方穷山恶水根本就活不下去，儿臣要是去了，那可就是死路一条啊，父皇真的忍心看儿臣去送死吗？");
               剧情对话板.onclick = function(){
                  对话打字效果("（皇上打算怎么做？）",["执意联姻","更换公主"]);
                  id('剧情an0').onclick = function(){
                     对话打字效果(子女.名称 + "：这一去恐怕再也见不到父皇了，儿臣叩谢父皇养育之恩……(┬＿┬)");
                     剧情对话板.onclick = function(){
                        属性.暴戾 += 10;
                        进入联姻程序(子女,阵营数据)
                        缓动黑幕();
						id('syb').style.display = 'block';
						id('syb2').style.display = 'none';id('sy').style.display = 'none';
                        id('剧情对话').style.display = 'none';
                     };
                  };
                  id('剧情an1').onclick = function(){
                     对话打字效果(子女.名称 + "：父皇果然是最爱儿臣的。(*^__^*) ");
                     剧情对话板.onclick = function() {
                        缓动黑幕();
                        id('剧情对话').style.display = 'none';
                     };
                  };
               };
            };
         };
      };
   };
}
function 祭拜毒死皇子(被害,焦躁,症状){
   var 称呼 = "哥";
   var _loc2_ = [];
   var _loc3_ = 0;
   while(_loc3_ < _all_child.length){
      var _loc4_ = _all_child[_loc3_];
      if(_loc4_.名称 !== 焦躁.名称&&_loc4_.名称 !== 被害.名称&&_loc4_.年龄 >= 16&&_loc4_.状态 == 0&&_loc4_.性别 == 0&&_loc4_.野心 > 50){
         _loc2_.push(_loc4_);
      }
      _loc3_ += 1;
   }
   if(凶手 !== undefined &&_loc2_.length!==0){
	   var 凶手 = _loc2_[random(_loc2_.length)];
	   if(凶手.序号 > 焦躁.序号){
	      称呼 = "弟";
	   }
      播放音乐("Music_18",1);
      id('剧情对话').style.display = 'block';
      出现这个人的头像(剧情头像,焦躁);
      新后宫图形读取程序(剧情背景,413248,"背景");
      对话打字效果("（宝华殿内，" + 焦躁.名称 + "正在给已故的" + 被害.名称 + "上香。）");
      剧情对话板.onclick = function(){
         对话打字效果(焦躁.名称 + "：" + 中文序号[被害.序号] + "弟，一路走好。");
         剧情对话板.onclick = function(){
            var _loc2_ = 0;
            while(_loc2_ < 剧情汇总.length){
               if(剧情汇总[_loc2_]._code == 112){
                  剧情汇总[_loc2_].达成 = 1;
               }
               _loc2_ += 1;
            }
            对话打字效果("皇上：咳咳！");
            剧情对话板.onclick = function(){
               对话打字效果(焦躁.名称 + "：啊！（" + 焦躁.名称 + "转身看到皇上，突然一惊）");
               剧情对话板.onclick = function(){
                  对话打字效果(焦躁.名称 + "：儿、儿臣参见父皇。");
                  剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                     对话打字效果("皇上：朕听说在" + 被害.名称 + "的灵堂前，你显得十分焦躁不安？老实告诉朕，到底是不是你下的手！？");
                     剧情对话板.onclick = function(){出现这个人的头像(剧情头像,焦躁);
                        对话打字效果(焦躁.名称 + "：父、父皇！儿臣不知是谁在诋毁儿臣，但是儿臣确实是清白的。儿臣当时不安，是另有原因……");
                        剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                           对话打字效果("皇上：另有原因？说给朕听听。");
                           剧情对话板.onclick = function(){出现这个人的头像(剧情头像,焦躁);
                              对话打字效果(焦躁.名称 + "：父皇也许不信，其实儿臣也不敢相信，但是儿臣看见了……是" + 中文序号[凶手.序号] + 称呼 + "，是他杀害了" + 中文序号[被害.序号] + "弟！");
                              剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                 对话打字效果("皇上：什么！？是" + 凶手.名称 + "！？");
                                 剧情对话板.onclick = function(){出现这个人的头像(剧情头像,焦躁);
                                    if(症状 == 0){
                                       对话打字效果(焦躁.名称 + "：那时，儿臣恰巧经过御膳房，听到里面有人谈话，是" + 中文序号[凶手.序号] + 称呼 + "在跟宫女说要吃莲子，还必须用白茄枝烧。让她们赶紧做完送过去。儿臣当时以为可能是" + 中文序号[凶手.序号] + 称呼 + "想吃这道菜了，便没在意，可是事后想想，" + 中文序号[被害.序号] + "弟当日刚刚吃过猪肚啊，若再与" + 中文序号[凶手.序号] + 称呼 + "一同食用莲子，二者相冲会有剧毒，必死无疑啊。");
                                    }
                                    else if(症状 == 1){
                                       对话打字效果(焦躁.名称 + "：那时，儿臣恰巧经过御花园，看到两个人鬼鬼祟祟，是" + 中文序号[凶手.序号] + 称呼 + "身边的太监。儿臣想追上去看看，可是那两人已经走远了，儿臣隐约看到二人手里拿着一个袋子，朝" + 中文序号[被害.序号] + "弟的寝殿方向去了。若那袋子里装的是毒虫，那" + 中文序号[被害.序号] + "弟岂不是在劫难逃……");
                                    }
                                    else if(症状 == 2){
                                       对话打字效果(焦躁.名称 + "：那时，儿臣正好去青炉房，想与方士探讨修仙之法，刚到就看见" + 中文序号[凶手.序号] + 称呼 + "身边的宫女取药出来，儿臣问了问，说是" + 中文序号[凶手.序号] + 称呼 + "秘制的丹药，要送给各位皇子每人一粒，但儿臣可从未收到过，若只有" + 中文序号[被害.序号] + "弟吃了，那这秘制的丹药岂不是毒药？");
                                    }
                                    else if(症状 == 3){
                                       对话打字效果(焦躁.名称 + "：父皇难道不觉得蹊跷吗？时疫怎么会那么容易传到宫里来？若是真有，那宫里患有时疫的人就不止一个两个了，" + 中文序号[被害.序号] + "弟，他根本不是得时疫死的，而是中毒致死！而这种毒，只有" + 中文序号[凶手.序号] + 称呼 + "宫内种植的所谓的西域名贵花草才能提炼而成。");
                                    }
                                    剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                       对话打字效果("皇上：" + 焦躁.名称 + "，你说的可是事实？");
                                       剧情对话板.onclick = function(){出现这个人的头像(剧情头像,焦躁);
                                          对话打字效果(焦躁.名称 + "：千真万确。");
                                          剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                             对话打字效果("皇上：那你为何不早说？！非要隐瞒到现在？");
                                             剧情对话板.onclick = function(){出现这个人的头像(剧情头像,焦躁);
                                                对话打字效果(焦躁.名称 + "：儿臣左右为难啊，如果儿臣告发了" + 中文序号[凶手.序号] + 称呼 + "，" + 中文序号[凶手.序号] + 称呼 + "必然会得到严惩，但儿臣就又少了一个兄弟。父皇看到两个儿子相残，难道内心就不痛吗？");
                                                剧情对话板.onclick = function(){
                                                   对话打字效果("（怎么办？要追查下去吗？）",["不追查","追查"]);
                                                      id("剧情an1").onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                                         对话打字效果("皇上：朕就是因为痛，才更要找出真凶，否则朕的儿子们不知道哪天就都被害死了。宣" + 凶手.名称 + "。朕要亲自审理这个案子。");
                                                         剧情对话板.onclick = function(){
                                                            投毒案件审理(被害,焦躁,凶手,称呼);
                                                            缓动黑幕();
                                                         };
                                                      };
                                                      id("剧情an0").onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                                         对话打字效果("皇上：是啊，为父内心也有不忍，本是同根生，相煎何太急。" + 焦躁.名称 + "，这件事就当你什么也没看见，朕什么也没听见，永远埋在心里，知道吗？");
                                                         剧情对话板.onclick = function(){出现这个人的头像(剧情头像,焦躁);
                                                            对话打字效果(焦躁.名称 + "：儿臣明白。");
                                                            剧情对话板.onclick = function(){
                                                               缓动黑幕();
                                                               id('剧情对话').style.display = 'none';
                                                               停止音乐();
                                                            };
                                                         };
                                                      };
                                                };
                                             };
                                          };
                                       };
                                    };
                                 };
                              };
                           };
                        };
                     };
                  };
               };
            };
         };
      };
   }
}
function 投毒案件审理(被害,焦躁,凶手,称呼){
	出现这个人的头像(剧情头像,凶手);
    对话打字效果("（少顷，" + 凶手.名称 + "面见皇上，虽然有" + 焦躁.名称 + "的指证，但" + 凶手.名称 + "却矢口否认。）");
    剧情对话板.onclick = function(){
      对话打字效果(凶手.名称 + "：绝无此事！！请父皇相信儿臣，儿臣从没有过害死" + 中文序号[被害.序号] + "弟的想法，更没有实施过毒杀。");
      剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
         对话打字效果("皇上：可是现在" + 焦躁.名称 + "看到了一些事情，证明就是你杀死了" + 被害.名称 + "，你作何解释？");
         剧情对话板.onclick = function(){出现这个人的头像(剧情头像,凶手);
            对话打字效果(凶手.名称 + "：儿臣说过了，儿臣没有做过那些事。儿臣倒是想问问，除了" + 焦躁.名称 + "，还有没有其他证人或者证据。单凭他一人之言，父皇就要断定是儿臣杀的人吗？");
            剧情对话板.onclick = function(){
               出现这个人的头像(剧情头像,焦躁);
               对话打字效果(焦躁.名称 + "：父皇，照顾" + 被害.名称 + "的宫人和一些相关人等，全部都以失职无能致皇子死亡的理由杖毙了，现在要想找证人，实在太难了。");
               剧情对话板.onclick = function(){
                  出现这个人的头像(剧情头像,凶手);
                  对话打字效果(凶手.名称 + "：没有证人？请父皇明察，这些人为什么这么快就统统都被杖毙？其中有些人真的罪可致死吗？换言之，这些人，到底是证明儿臣有罪的，还是证明儿臣清白的！？");
                  剧情对话板.onclick = function(){
                     出现这个人的头像(剧情头像,焦躁);
                     对话打字效果(焦躁.名称 + "：慎刑司为何这次动作如此迅速？难道不正是" + 中文序号[凶手.序号] + 称呼 + "你的人给慎刑司掌事施加压力而成的吗？");
                     剧情对话板.onclick = function(){
                        出现这个人的头像(剧情头像,凶手);
                        对话打字效果(凶手.名称 + "：我的人？慎刑司是能随便指使的了的吗？我" + 凶手.封号 + "府上的人可没那么大本领。反而我倒是看你在灵堂上那不安的样子，倒是很像凶手呢！我前些日子还看到你和" + 中文序号[被害.序号] + "弟宫里的人私下来往，那人该不会是你提前安插进去的杀手吧？");
                        剧情对话板.onclick = function(){
                           出现这个人的头像(剧情头像,焦躁);
                           对话打字效果(焦躁.名称 + "：你……！");
                           剧情对话板.onclick = function(){
                              对话打字效果("（现在证据无法收集充足，眼看二人就要反目成仇，怎么办？）",["日后再查","断定" + 焦躁.名称 + "有罪","断定" + 凶手.名称 + "有罪"]);
                                 id("剧情an2").onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                    对话打字效果("皇上：住口吧，" + 凶手.名称 + "，你既已杀害了亲兄弟，还要污蔑另一个兄弟吗？");
                                    剧情对话板.onclick = function(){出现这个人的头像(剧情头像,凶手);
                                       对话打字效果(凶手.名称 + "：父、父皇，儿臣没有啊！儿臣真的没有啊！");
                                       剧情对话板.onclick = function(){
                                          对话打字效果("（皇上闭上眼睛，摆了摆手）：杀害兄弟，掩盖证据，消灭证人，污蔑别人，哎，朕真是太失望了。你不配做朕的儿子。");
                                          剧情对话板.onclick = function(){
                                             对话打字效果(凶手.名称 + "：父皇！！！");
                                             剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                                对话打字效果("皇上：朕不要求你偿命，即日起，" + 凶手.封号 + "除皇籍，逐出京城，永世不得回京。");
                                                剧情对话板.onclick = function(){出现这个人的头像(剧情头像,凶手);
                                                   对话打字效果(凶手.名称 + "：父皇！为什么不愿意相信儿臣呢？");
                                                   剧情对话板.onclick = function(){
                                                      凶手.状态 = 2;
                                                      删除跟这个人有关的三方相性(凶手);
                                                      缓动黑幕();
                                                      id('剧情对话').style.display = 'none';
                                                      停止音乐();
                                                   };
                                                };
                                             };
                                          };
                                       };
                                    };
                                 };
                                 id("剧情an1").onclick = function(){
                                    新后宫图形读取程序(剧情头像,0,"皇帝");
                                    对话打字效果("皇上：住口吧，" + 焦躁.名称 + "，朕早就不该听信你，你既已杀害了亲兄弟，还要污蔑另一个兄弟吗？");
                                    剧情对话板.onclick = function(){出现这个人的头像(剧情头像,焦躁);
                                       对话打字效果(焦躁.名称 + "：父、父皇，儿臣没有啊！儿臣真的没有啊！");
                                       剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                          对话打字效果("皇上：你能骗过朕一次，但朕不会让你骗第二次，" + 凶手.名称 + "言辞恳切，并不像杀人凶手。反而，你对于为何在灵堂神情不安的解释更加不实。杀人者祭拜被杀者，当然会不安，还会怕恶鬼报仇呢。");
                                          剧情对话板.onclick = function(){出现这个人的头像(剧情头像,焦躁);
                                             对话打字效果(焦躁.名称 + "：父皇！！！");
                                             剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                                对话打字效果("皇上：好了，朕不要求你偿命，即日起，" + 焦躁.封号 + "除皇籍，逐出京城，永世不得回京。");
                                                剧情对话板.onclick = function(){出现这个人的头像(剧情头像,焦躁);
                                                   对话打字效果(焦躁.名称 + "：父皇！为什么不愿意相信儿臣呢？");
                                                   剧情对话板.onclick = function(){
                                                      焦躁.状态 = 2;
                                                      删除跟这个人有关的三方相性(焦躁);
                                                      缓动黑幕();
                                                      id('剧情对话').style.display = 'none';
                                                      停止音乐();
                                                   };
                                                };
                                             };
                                          };
                                       };
                                    };
                                 };
                                 id("剧情an0").onclick = function(){
									 新后宫图形读取程序(剧情头像,0,"皇帝");
                                    对话打字效果("皇上：好了，都住口！吵来吵去也没法分辨你们谁是谁非。");
                                    剧情对话板.onclick = function(){
                                       出现这个人的头像(剧情头像,凶手);
                                       对话打字效果(凶手.名称 + "：父、父皇，儿臣是冤枉的！");
                                       剧情对话板.onclick = function(){
                                          出现这个人的头像(剧情头像,焦躁);
                                          对话打字效果(焦躁.名称 + "：父皇！！！");
                                          剧情对话板.onclick = function(){新后宫图形读取程序(剧情头像,0,"皇帝");
                                             对话打字效果("皇上：案子先暂时搁置，朕会查清楚到底谁是幕后凶手，一定不会放过凶手。");
                                             剧情对话板.onclick = function(){
                                                缓动黑幕();
                                                id('剧情对话').style.display = 'none';
                                                停止音乐();
                                             };
                                          };
                                       };
                                    };
                                 };
                           };
                        };
                     };
                  };
               };
            };
         };
      };
   };
}
function 皇子来参见(){
   主角.皇子参见 = 1;
   var _loc2_ = [];
   var _loc3_ = 0;
   while(_loc3_ < _all_child.length){
      if((_all_child[_loc3_].关系 > 12||_all_child[_loc3_].野心 > 60)&&_all_child[_loc3_].年龄 > 14&&_all_child[_loc3_].性别 == 0&&_all_child[_loc3_].状态 == 0&&_all_child[_loc3_].病 == 0){
         _loc2_.push(_all_child[_loc3_]);
      }
      _loc3_ += 1;
   }
   var 皇子 = _loc2_[random(_loc2_.length)];
   if(皇子 !== undefined){
      id('剧情对话').style.display = 'block';
      出现这个人的头像(剧情头像,皇子);新后宫图形读取程序(剧情背景,2,"背景");
      对话打字效果(皇子.名称 + "：儿臣给父皇请安。");
      剧情对话板.onclick = function(){
         对话打字效果("皇上：哦？" + 皇子.名称 + "啊，急着见朕有什么事吗？");
         剧情对话板.onclick = function(){
            var _loc2_ = [];
            _loc2_.push("上好的参汤");
            _loc2_.push("新制的鹿血汤");
            _loc2_.push("清热解毒的莲子羹");
            _loc2_.push("凝神定气的茗茶及糕点");
            _loc2_.push("一些药膳");
            对话打字效果(皇子.名称 + "：儿臣听闻父皇近日政务繁忙，十分劳累，所以特意命人备了" + _loc2_[random(_loc2_.length)] + "，还望父皇注意龙体。");
            剧情对话板.onclick = function(){
               对话打字效果("（皇子" + 皇子.名称 + "来请安，并且送来了东西，要如何处理？）",["训斥","不屑","称赞"]);
               id("剧情an2").onclick = function(){
                  对话打字效果("皇上：吾儿长大了，知道体谅父皇的辛苦了，真是个有孝心的好孩子。朕很欣慰。希望你以后也能替朕多分担一些。");
                  剧情对话板.onclick = function(){
                     对话打字效果(皇子.名称 + "：是，父皇日后有何事需要儿臣去办，儿臣一定不负期望。");
                     剧情对话板.onclick = function(){
                        皇子.关系 += 1 + random(4);
                        属性.健康 += 2;
                        缓动黑幕();
                        id('剧情对话').style.display = 'none';
                     };
                  };
               };
               id("剧情an1").onclick = function(){
                  对话打字效果("皇上：朕知道了，放这吧。朕今日很忙，你先退下吧。");
                  剧情对话板.onclick = function(){
                     对话打字效果(皇子.名称 + "：是，儿臣告退。");
                     剧情对话板.onclick = function(){
                        皇子.关系 += 1;
                        缓动黑幕();
                        id('剧情对话').style.display = 'none';
                     };
                  };
               };
               id("剧情an0").onclick = function(){
                  对话打字效果("皇上：你来见朕就为了给朕送这个？这些都是女儿家的小心思，小家子气。你是皇子，没事你就回去多读读书，练练兵法，以后才能帮得上朕，别弄这些没用的，懂吗？");
                  剧情对话板.onclick = function(){
                     对话打字效果(皇子.名称 + "：是，儿臣知错了，儿臣一定谨记父皇的教诲。");
                     剧情对话板.onclick = function(){
                        皇子.关系 -= 5;
                        缓动黑幕();
                        id('剧情对话').style.display = 'none';
                     };
                  };
               };
            };
         };
      };
   }
}
function 玄武门之变(太子,天赋最高的成年皇子){
   播放音乐("Music_36",1);
   id('剧情对话').style.display = 'block';
   出现这个人的头像(剧情头像,天赋最高的成年皇子);
   新后宫图形读取程序(剧情背景,14,"背景");
   对话打字效果("皇上：" + 天赋最高的成年皇子.名称 + "你有什么要事禀报啊？");
   剧情对话板.onclick = function(){
      对话打字效果(天赋最高的成年皇子.名称 + "：父皇，儿臣要告发太子与后宫嫔妃淫乱，屯私兵于东宫，并蓄谋要将儿臣在宫外暗杀。");
      剧情对话板.onclick = function(){
         var _loc2_ = 0;
         while(_loc2_ < 剧情汇总.length){
            if(剧情汇总[_loc2_]._code == 98){
               剧情汇总[_loc2_].达成 = 1;
            }
            _loc2_ += 1;
         }
         对话打字效果("皇上：竟有这等事！");
         剧情对话板.onclick = function(){
            对话打字效果(天赋最高的成年皇子.名称 + "：儿臣不敢妄言，证据确凿。儿臣丝毫没有对不起太子，现在他却打算杀死儿臣。如今我快要含冤而死，永远地离开父皇，魂魄归于黄泉了！");
            剧情对话板.onclick = function(){
               对话打字效果("皇上：明天朕就审问此事，你应该及早前来参见朕。");
               剧情对话板.onclick = function(){
                  对话打字效果(天赋最高的成年皇子.名称 + "：请父皇明察。");
                  剧情对话板.onclick = function(){
                     新后宫图形读取程序(剧情头像,0,"特殊");
                     新后宫图形读取程序(剧情背景,599993,"背景");
                     对话打字效果("（………………东宫内………………）");
                     剧情对话板.onclick = function(){
                        新后宫图形读取程序(剧情头像,42,"特殊");
                        对话打字效果("太监：事情的经过大概就是这样，太子早做准备吧，小的不能久留，先走了。");
                        剧情对话板.onclick = function(){
                           出现这个人的头像(剧情头像,太子);
                           对话打字效果(太子.名称 + "：好，辛苦你了，以后父皇有什么动向及时向我禀报。");
                           剧情对话板.onclick = function(){
                              新后宫图形读取程序(剧情头像,37,"特殊");
                              对话打字效果("官员：太子殿下，眼下我们应当管好东宫的士兵，托称有病不去上朝，以便观察形势。");
                              剧情对话板.onclick = function(){
                                 出现这个人的头像(剧情头像,太子);
                                 对话打字效果(太子.名称 + "：宫中都是我们早早安排下的自己人，应该没关系，我先入大内皇宫逼父皇表态。");
                                 剧情对话板.onclick = function(){
                                    对话打字效果(太子.名称 + "：来人，准备车马，立刻去觐见皇上。");
                                    剧情对话板.onclick = function(){
                                       新后宫图形读取程序(剧情头像,0,"特殊");
                                       新后宫图形读取程序(剧情背景,438005,"背景");
                                       对话打字效果("（………………玄武门………………）");
                                       剧情对话板.onclick = function(){
                                          出现这个人的头像(剧情头像,太子);
                                          对话打字效果(太子.名称 + "：怎么了？玄武门怎么不开。");
                                          剧情对话板.onclick = function(){
                                             新后宫图形读取程序(剧情头像,36,"特殊");
                                             对话打字效果("禁卫总领：太子爷辛苦啦，先歇歇吧。一会儿" + 天赋最高的成年皇子.名称 + "殿下有话跟您说。");
                                             剧情对话板.onclick = function(){
                                                出现这个人的头像(剧情头像,太子);
                                                对话打字效果(太子.名称 + "：狗东西！你忘了当初我给你的好了是吗？居然倒戈向" + 天赋最高的成年皇子.名称 + "那家伙，忘恩负义！赶快开门，我要面见父皇！");
                                                剧情对话板.onclick = function(){
                                                   停止音乐();
                                                   出现这个人的头像(剧情头像,天赋最高的成年皇子);
                                                   对话打字效果(天赋最高的成年皇子.名称 + "：忘恩负义？太子何曾不是不顾手足之情，要致我于死地？");
                                                   剧情对话板.onclick = function(){
                                                      出现这个人的头像(剧情头像,太子);
                                                      对话打字效果(太子.名称 + "：啊！" + 天赋最高的成年皇子.名称 + "！！！");
                                                      剧情对话板.onclick = function(){
                                                         播放音乐(music,"Music_23",1);
                                                         对话打字效果("（这一刻，提前埋伏好的" + 天赋最高的成年皇子.名称 + "的士兵冲了出来）");
                                                         剧情对话板.onclick = function()
                                                         {
                                                            对话打字效果(太子.名称 + "：不好！快撤！（形势紧急，太子的人马四处逃窜，太子上马奔进小树林里）");
                                                            剧情对话板.onclick = function()
                                                            {
                                                               出现这个人的头像(剧情头像,天赋最高的成年皇子);
                                                               对话打字效果(天赋最高的成年皇子.名称 + "：太子殿下，别跑啊！（" + 天赋最高的成年皇子.名称 + "策马追了上去）");
                                                               剧情对话板.onclick = function()
                                                               {
                                                                  战斗震屏程序();
                                                                  出现这个人的头像(剧情头像,太子);
                                                                  对话打字效果(太子.名称 + "：嘿！（太子慌忙拉弓射向" + 天赋最高的成年皇子.名称 + "）");
                                                                  剧情对话板.onclick = function()
                                                                  {
                                                                     出现这个人的头像(剧情头像,天赋最高的成年皇子);
                                                                     对话打字效果(天赋最高的成年皇子.名称 + "：哼。（箭没有射中，" + 天赋最高的成年皇子.名称 + "躲过之后，拉弓射向太子方向）");
                                                                     剧情对话板.onclick = function()
                                                                     {
                                                                        战斗震屏程序();
                                                                        出现这个人的头像(剧情头像,太子);
                                                                        对话打字效果(太子.名称 + "：啊啊啊！（太子中箭了，从马上摔了下来）");
                                                                        剧情对话板.onclick = function()
                                                                        {
                                                                           出现这个人的头像(剧情头像,天赋最高的成年皇子);
                                                                           对话打字效果(天赋最高的成年皇子.名称 + "：太子殿下，对不住了。");
                                                                           剧情对话板.onclick = function()
                                                                           {
                                                                              战斗震屏程序();
                                                                              对话打字效果("（" + 天赋最高的成年皇子.名称 + "追上来，一刀砍下了太子的首级）");
                                                                              剧情对话板.onclick = function()
                                                                              {
                                                                                 新后宫图形读取程序(剧情头像,37,"特殊");
                                                                                 对话打字效果("官员：稳住稳住，你们快去找太子殿下，保护太子殿下。（玄武门前的太子党慌乱不堪）");
                                                                                 剧情对话板.onclick = function()
                                                                                 {
                                                                                    出现这个人的头像(剧情头像,天赋最高的成年皇子);
                                                                                    对话打字效果(天赋最高的成年皇子.名称 + "：不用找了。太子在这呢。（" + 天赋最高的成年皇子.名称 + "手里提着太子的首级喊道）");
                                                                                    剧情对话板.onclick = function()
                                                                                    {
                                                                                       新后宫图形读取程序(剧情头像,37,"特殊");
                                                                                       对话打字效果("官员：啊？！太子殿下已经……这……");
                                                                                       剧情对话板.onclick = function()
                                                                                       {
                                                                                          出现这个人的头像(剧情头像,天赋最高的成年皇子);
                                                                                          对话打字效果(天赋最高的成年皇子.名称 + "：尔等还不赶快缴械投降！");
                                                                                          剧情对话板.onclick = function()
                                                                                          {
                                                                                             新后宫图形读取程序(剧情头像,37,"特殊");
                                                                                             对话打字效果("官员：唉…………");
                                                                                             剧情对话板.onclick = function()
                                                                                             {
                                                                                                新后宫图形读取程序(剧情头像,0,"特殊");
                                                                                                新后宫图形读取程序(剧情背景,14,"背景");
                                                                                                对话打字效果("（………………大内………………）");
                                                                                                剧情对话板.onclick = function()
                                                                                                {
                                                                                                   新后宫图形读取程序(剧情头像,42,"特殊");
                                                                                                   对话打字效果("太监：皇上，玄武门禁卫总领前来觐见。");
                                                                                                   剧情对话板.onclick = function()
                                                                                                   {
                                                                                                      对话打字效果("皇上：传。");
                                                                                                      剧情对话板.onclick = function()
                                                                                                      {
                                                                                                         新后宫图形读取程序(剧情头像,36,"特殊");
                                                                                                         对话打字效果("皇上：今日作乱的人是谁？爱卿到此做什么？");
                                                                                                         剧情对话板.onclick = function()
                                                                                                         {
                                                                                                            对话打字效果("禁卫总领：" + 天赋最高的成年皇子.名称 + "殿下因为太子作乱，起兵诛杀了他。殿下担心惊动陛下，故派臣担任警卫。");
                                                                                                            剧情对话板.onclick = function()
                                                                                                            {
                                                                                                               对话打字效果("皇上问身边的随臣：不料今天竟然会出现这种事情，你们认为应当怎么办呢？");
                                                                                                               剧情对话板.onclick = function()
                                                                                                               {
                                                                                                                  新后宫图形读取程序(剧情头像,19,"特殊");
                                                                                                                  对话打字效果("曹夙峰：太子淫乱后宫，屯集私兵，结党营私，且嫉妒" + 天赋最高的成年皇子.名称 + "皇子善于谋略，威望又高，生怕被多去太子之位，便策划奸邪的阴谋。现在，" + 天赋最高的成年皇子.名称 + "皇子已经声讨并诛杀了他们，功盖宇宙，天下归心，陛下如果能够决定立他为太子，将国家大事委托于他，就不会再生事端了。");
                                                                                                                  剧情对话板.onclick = function()
                                                                                                                  {
                                                                                                                     对话打字效果("皇上：好！这正是我素来的心愿啊。传皇子" + 天赋最高的成年皇子.名称 + "。");
                                                                                                                     剧情对话板.onclick = function()
                                                                                                                     {
                                                                                                                        出现这个人的头像(剧情头像,天赋最高的成年皇子);
                                                                                                                        对话打字效果(天赋最高的成年皇子.名称 + "：父皇……儿臣杀害了兄弟手足。（" + 天赋最高的成年皇子.名称 + "跪了下来）");
                                                                                                                        剧情对话板.onclick = function()
                                                                                                                        {
                                                                                                                           对话打字效果("皇上：我儿快起来。朕本就属意于你，太子作乱，朕也容不下他，是你替朕讨伐了他，朕十分欣慰。今后你就是太子了。");
                                                                                                                           剧情对话板.onclick = function()
                                                                                                                           {
                                                                                                                              对话打字效果(天赋最高的成年皇子.名称 + "：父皇……。（" + 天赋最高的成年皇子.名称 + "伏在皇上的膝前，号啕大哭良久。）");
                                                                                                                              剧情对话板.onclick = function()
                                                                                                                              {
                                                                                                                                 对话打字效果("（改立皇子【" + 天赋最高的成年皇子.名称 + "】为太子）");
                                                                                                                                 剧情对话板.onclick = function()
                                                                                                                                 {
                                                                                                                                    判定这个子女死亡(太子);
                                                                                                                                    id('剧情对话').style.display = 'none';
                                                                                                                                    缓动黑幕();
                                                                                                                                    停止音乐(music);
                                                                                                                                 };
                                                                                                                              };
                                                                                                                           };
                                                                                                                        };
                                                                                                                     };
                                                                                                                  };
                                                                                                               };
                                                                                                            };
                                                                                                         };
                                                                                                      };
                                                                                                   };
                                                                                                };
                                                                                             };
                                                                                          };
                                                                                       };
                                                                                    };
                                                                                 };
                                                                              };
                                                                           };
                                                                        };
                                                                     };
                                                                  };
                                                               };
                                                            };
                                                         };
                                                      };
                                                   };
                                                };
                                             };
                                          };
                                       };
                                    };
                                 };
                              };
                           };
                        };
                     };
                  };
               };
            };
         };
      };
   };
}